[{"Title":"Blockchain Transformation in Industry: DLT for Industrial Use","Date":"Di., 25. Aug. 2020 16:00 CEST","Price":"Kostenlos","Information":"                        Evgenia Rosa Principal Solution Engineer at Oracle   Arne Flick CEO at IOT1 Academy   Diana Rees CEO at ZkSystems   Matthias Jugel CTO at Ubirch   Blockchain technology unleashed a wave of “what ifs” around the world in recent years.   Distributed ledger technology holds immense potential for improving efficiency, providing real-time information, and reducing costs.   The originators of blockchain developed it to provide a technological foundation for digital currency. Early generations of blockchain did not support industrial applications effectively, owing to limitations in network scalability, interoperability, and processing speed. The versions now under development, however, use new consensus protocols that improve the efficiency of the verification process by increasing the number of transactions per second and reducing computing costs.   The improvements under development will enhance interaction between blockchain technology and the Internet of Things (IoT).   Although blockchain is becoming simpler to deploy in the factory, it is not a panacea for challenges in industrial operations...   During this online event we will focus on different DLT for Industrial Use and will discuss how Blockchain Technology of the 3rd Generation can help to transform the Industry as we know it today.      In this event – jointly organised by three organisations: Berlin Partner für Wirtschaft und Technologie | PositiveBlockchain.io | SIBB e.V. - ICT & Digital Business Association Berlin & Brandenburg – we will present some of the best practices from identity and access management sector and will learn about the application of blockchain technology (and other distributed ledger technologies) for the benefit of the citizens, communities and environment.   Join us!   In cooperation with:      Supported by:   This event is part of the Deep Tech Campagin Berlin:   ----   By registering for the above-mentioned event organised by SIBB e.V. or one of the partner initiatives, you agree that photos or videos taken at this event and depicting you may be reproduced, distributed, broadcast and made publicly accessible by SIBB e.V. by name. This licence is granted free of charge.This consent is revocable. You have the option at any time to have photos/videos taken by you or your companion at the event and which are on our website or on our pages in social media platforms (in particular Facebook and Twitter) or on youtube removed by SIBB e.V. All you need to do is send a short e-mail to veranstaltung@sibb.de.            Di., 25. August 2020                                       ","Link":"https://www.eventbrite.de/e/blockchain-transformation-in-industry-dlt-for-industrial-use-tickets-111305222918?aff=ebdssbonlinesearch"},{"Title":"Introduction to Blockchain","Date":"Mi., 5. Aug. 2020 20:00 CEST","Price":"Ab 49,00 CA$","Information":"                        Eventbrite's fee is nonrefundable.   This workshop is designed to provide the student with a foundational background and understanding of the emerging technology called Blockchain and Cryptocurrencies and further to spark interest in the biggest technology since the internet   This workshop is the first in a series of Blockchain workshops by UCW.   Each full workshop is two hours in length (the free introductory workshop is 60 minutes) and participants will get a Certificate of Completion from UCW for each full workshop completed. All workshops will be available online to participants for a limited period of time after the live event.   The workshops can be taken individually or as a pathway to a Certificate of Achievement for completing all five workshops through the Canadian College of Technology and Business (CCTB).   At the end of the workshops, attendees should leave with the knowledge and vocabulary needed to handle blockchain and cryptocurrency in professional situations. They will also acquire the tools necessary to develop their organization’s blockchain and/or cryptocurrency strategy and successfully promote it. For the management of the firm, having staff with such knowledge and expertise increases the probability of creative situations where opportunities can be extended to clients.   These are the other workshops available in the series.   Introduction to Blockchain - 11 am (PDT) July 29, 2020   This workshop is designed to provide the student with a foundational background and understanding of the emerging technology called Blockchain and Cryptocurrencies and further to spark interest in the biggest technology since the internet   Introduction to Blockchain Networks - 11 am (PDT) Aug. 12, 2020   This module provides learners with information on various types of Blockchain Networks including public, private, consortium and permissioned networks. What Blockchain networks are used for, the value they bring to business and society and how networks differ from each other.   Introduction to Blockchain Platforms - 11 am (PDT) Aug. 19, 2020   This two hour workshop provides learners with an introduction to the specific information related to Blockchain platforms including Hyper Ledger, Bitcoin and Ethereum.   Cryptocurrencies and the Digital Economy - 11 am (PDT) Aug. 26, 2020   This module is designed to provide you with a foundational background and understanding Cryptocurrencies, and the Digital Economy.   The Future of Blockchain: Challenges and Opportunities - 11 am (PDT) Sept. 2, 2020   This module is designed to provide you with a foundational background and understanding of the future of the emerging technology called Blockchain.   Learn more                                                                  ","Link":"https://www.eventbrite.ca/e/introduction-to-blockchain-tickets-114193852888?aff=ebdssbonlinesearch"},{"Title":"Blockchain UNconference","Date":"Mi., 14. Okt. 2020 18:00 CEST","Information":"","Link":""},{"Title":"OVERVIEW OF BLOCKCHAIN","Date":"Sa., 25. Juli 2020 15:00 CEST","Price":"Ab 200,00 £","Information":"                        The objective of this unit is to develop the learner's skills and knowledge about the Blockchain technology and its usage. The material will be provided during the lecture along with case study/homework for the next lecture. This course is a mix of theory and practical case study.   Access to laptop/desktop and good internet connectivity   INTENDED LEARNING OUTCOMES   Having successfully completed this unit the student is expected to:   1. Gain knowledge of the Blockchain technology and its key concepts.   2. Evaluate related cryptographic concepts and apply to Blockchain.   3. Understand and evaluate different Blockchain use cases in real world scenario.   LEARNING & TEACHING APPROACH:   Online classes and case studies   COURSE CONTENT   1. Blockchain Fundamentals   What is Blockchain, Blockchain impact and potential for change around the world, understand how Blockchain is applied to all aspects of business, demonstrate some of the immediate Blockchain use cases in technology, business, and enterprise products and institutions, Blockchain objectives, transactions and blocks, trustless and distributed ledger.   2. Cryptography Basics   Cryptographic hash functions, encryption, privacy enhancing, and hash commitment schemes, digital signatures, transactional blocks, smart contracts working, and Merkle tree.   3. Blockchain Use Cases and Implementation   Use case: Enterprise Blockchain implementations (JP Morgan’s Quorum, Corda, Ripple, HyperLedger), industry use cases for Blockchain, and the increasing regulations surrounding Blockchain.   PRICE & DURATION   £200   3 Saturdays (2pm - 5pm)   Students will attend 3 online sessions of 3 hours each on Saturday. A certification of training completion will be provided by IOSpeed Limited.         Sat, 25 Jul 2020, 15:00 –                                       ","Link":"https://www.eventbrite.co.uk/e/overview-of-blockchain-tickets-112798056022?aff=ebdssbonlinesearch"},{"Title":"L.A. Blockchain Summit","Date":"Di., 6. Okt. 2020 18:00 CEST","Information":"","Link":""},{"Title":"ONLINE-BEM-Arbeitsgruppe \"BigData - Blockchain\" September 2020","Date":"Do., 10. Sep. 2020 15:30 CEST","Price":"Kostenlos","Information":"                        Digitalisierung   Blockchain-Anwendungen   autonomes / teilautonomes Fahren...               Do., 10. September 2020   15:30 – 17:30 CEST   Zum Kalender hinzufügen   Online-Event   Veranstalter von ONLINE-BEM-Arbeitsgruppe \"BigData - Blockchain\" September 2020   Der Bundesverband eMobilität (BEM) ist ein Zusammenschluss von Unternehmen, Institutionen, Wissenschaftlern und Anwendern aus dem Bereich der Elektromobilität, die sich dafür einsetzen, die Mobilität in Deutschland auf Basis Erneuerbarer Energien auf Elektromobilität umzustellen. Zu den Aufgaben des BEM gehört die aktive Vernetzung von Wirtschaftsakteuren für die Entwicklung nachhaltiger und intermodaler Mobilitätslösungen, die Verbesserung der gesetzlichen Rahmenbedingungen für den Ausbau der eMobilität und die Durchsetzung von mehr Chancengleichheit bei der Umstellung auf emissionsarme Antriebskonzepte. Der Verband wurde 2009 gegründet. Er organisiert über 300 Mitgliedsunternehmen, die ein jährliches Umsatzvolumen von über 100 Milliarden Euro verzeichnen und über eine Million Mitarbeiter weltweit beschäftigen.   © 2020 Eventbrite   \n                    Ihre E-Mail wird nur vom Eventveranstalter gesehen. Datenschutzrichtlinien anzeigen\n                   Outlook-Kalender   Google-Kalender   Apple-Kalender   Yahoo! Kalender   Sie werden eine Stunde vor Start des Vorverkaufs per E-Mail benachrichtigt. Die Erinnerungen können Sie auf der Eventseite verwalten.   Events sind Social Happenings. Möchten Sie, dass Ihre anstehenden Events für Ihre Facebook-Freunde sichtbar sind?   Bei der Prüfung dieses Events sind wir auf Ihre Mithilfe angewiesen. Bitte geben Sie den Grund für Ihre Meldung an.","Link":"https://www.eventbrite.de/e/online-bem-arbeitsgruppe-bigdata-blockchain-september-2020-tickets-115167392772?aff=ebdssbonlinesearch"},{"Title":"Introduction to Blockchain Networks","Date":"Mi., 12. Aug. 2020 20:00 CEST","Price":"Ab 49,00 CA$","Information":"                        Eventbrite's fee is nonrefundable.   This module provides learners with information on various types of Blockchain Networks including public, private, consortium and permissioned networks. What Blockchain networks are used for, the value they bring to business and society and how networks differ from each other.   This workshop is the second workshop of a series of Blockchain workshops by UCW.   Each full workshop is two hours in length (the free introductory workshop is 60 minutes) and participants will get a Certificate of Completion from UCW for each full workshop completed. All workshops will be available online to participants for a limited period of time after the live event.   The workshops can be taken individually or as a pathway to a Certificate of Achievement for completing all five workshops through the Canadian College of Technology and Business (CCTB).   At the end of the workshops, attendees should leave with the knowledge and vocabulary needed to handle blockchain and cryptocurrency in professional situations. They will also acquire the tools necessary to develop their organization’s blockchain and/or cryptocurrency strategy and successfully promote it. For the management of the firm, having staff with such knowledge and expertise increases the probability of creative situations where opportunities can be extended to clients.   These are the other workshops available in the series.   Introduction to Blockchain - 11 am (PDT) Aug. 5, 2020   This workshop is designed to provide the student with a foundational background and understanding of the emerging technology called Blockchain and Cryptocurrencies and further to spark interest in the biggest technology since the internet   Introduction to Blockchain Networks - 11 am (PDT) Aug. 12, 2020   This module provides learners with information on various types of Blockchain Networks including public, private, consortium and permissioned networks. What Blockchain networks are used for, the value they bring to business and society and how networks differ from each other.   Introduction to Blockchain Platforms - 11 am (PDT) Aug. 19, 2020   This two hour workshop provides learners with an introduction to the specific information related to Blockchain platforms including Hyper Ledger, Bitcoin and Ethereum.   Cryptocurrencies and the Digital Economy - 11 am (PDT) Aug. 26, 2020   This module is designed to provide you with a foundational background and understanding Cryptocurrencies, and the Digital Economy.   The Future of Blockchain: Challenges and Opportunities - 11 am (PDT) Sept. 2, 2020   This module is designed to provide you with a foundational background and understanding of the future of the emerging technology called Blockchain.   Learn more                                                               ","Link":"https://www.eventbrite.ca/e/introduction-to-blockchain-networks-tickets-114197020362?aff=ebdssbonlinesearch"},{"Title":"Introduction to Blockchain Platforms","Date":"Mi., 19. Aug. 2020 20:00 CEST","Price":"Ab 49,00 CA$","Information":"                        Eventbrite's fee is nonrefundable.   This two hour workshop provides learners with an introduction to the specific information related to Blockchain platforms including Hyper Ledger, Bitcoin and Ethereum.   This workshop is the third in a series of Blockchain workshops by UCW.   Each full workshop is two hours in length (the free introductory workshop is 60 minutes) and participants will get a Certificate of Completion from UCW for each full workshop completed. All workshops will be available online to participants for a limited period of time after the live event.   The workshops can be taken individually or as a pathway to a Certificate of Achievement for completing all five workshops through the Canadian College of Technology and Business (CCTB).   At the end of the workshops, attendees should leave with the knowledge and vocabulary needed to handle blockchain and cryptocurrency in professional situations. They will also acquire the tools necessary to develop their organization’s blockchain and/or cryptocurrency strategy and successfully promote it. For the management of the firm, having staff with such knowledge and expertise increases the probability of creative situations where opportunities can be extended to clients.   These are the other workshops available in the series.   Introduction to Blockchain - 11 am (PDT) July 29, 2020   This workshop is designed to provide the student with a foundational background and understanding of the emerging technology called Blockchain and Cryptocurrencies and further to spark interest in the biggest technology since the internet   Introduction to Blockchain Networks - 11 am (PDT) Aug. 12, 2020   This module provides learners with information on various types of Blockchain Networks including public, private, consortium and permissioned networks. What Blockchain networks are used for, the value they bring to business and society and how networks differ from each other.   Introduction to Blockchain Platforms - 11 am (PDT) Aug. 19, 2020   This two hour workshop provides learners with an introduction to the specific information related to Blockchain platforms including Hyper Ledger, Bitcoin and Ethereum.   Cryptocurrencies and the Digital Economy - 11 am (PDT) Aug. 26, 2020   This module is designed to provide you with a foundational background and understanding Cryptocurrencies, and the Digital Economy.   The Future of Blockchain: Challenges and Opportunities - 11 am (PDT) Sept. 2, 2020   This module is designed to provide you with a foundational background and understanding of the future of the emerging technology called Blockchain.   Learn more                                                               ","Link":"https://www.eventbrite.ca/e/introduction-to-blockchain-platforms-tickets-114198137704?aff=ebdssbonlinesearch"},{"Title":"Enterprise Blockchain – ein realistischer Blick auf Kosten/Nutzen","Date":"Fr., 31. Juli 2020 08:30 CEST","Price":"Ab 478,71 €","Information":"                        Der Fokus liegt im Gegensatz zu anderen Angeboten nicht auf einer generellen Beschreibung der Blockchain-Technologie oder dem eventuellen Potential möglicher Use-Cases im Zeitraum der nächsten 3-10 Jahre.   Stattdessen liegt er auf den gegenwärtigen, konkreten Kosten/Nutzen-Überlegungen und Stand der Technik, die für konkrete Anwendungen jenseits von ersten Prototypen relevant sind.   So liefert das Seminar einen realistischen Überblick über das Anwendungspotential und deckt die Schnittmenge zwischen technologischen und strategischen Überlegungen ab. Der Kernpunkt der Technologie Enterprise Blockchain „dezentral“ wird zudem in Hinblick auf die Unternehmensstrategie sowie Umsetzungsfragestellungen in einer bestehenden Wettbewerbslandschaft beschrieben und geprüft.   Die technologischen Möglichkeiten und Begrenzungen werden analysiert und in den Kontext kommerzieller Anwendung gestellt sowie offene Fragen angesprochen. Eine Checkliste der wichtigsten Faktoren zur Nachverfolgung wird ebenso eingeführt.   Die Informationen insbesondere zu Kosten und dem Stand der Technik basieren auf der von Iceventure durchgeführten Enterprise Blockchain Studie 2018. Dies ist die erste Studie, die die Betrachtung von Total Cost of Ownership anwendet und alle technischen Elemente untersucht.      Das Seminar gliedert sich in vier Teile. Zunächst wird an das Thema Enterprise Blockchain herangeführt und die Unterschiede zur ursprünglichen Blockchain-Technologie dargelegt. Im zweiten Teil werden die Eigenschaften, der aktuelle Stand, technologischen Probleme und Anwendungen der Enterprise Blockchain detailliert beschrieben. Auch wird eine Übersicht über aktuelle Aktivitäten wie z.B. Konsortien und Serviceanbietern gegeben. Im dritten Abschnitt wird die Enterprise Blockchain in den Kontext des Marktes und der Industrien gesetzt und die üblichen Aussagen des revolutionären Potentials der Blockchain geprüft. Zuletzt werden verschiedene gängige Use Cases (EV-Ladeinfrastruktur, Supply Chain, Finanzen) im Hinblick auf praktische Umsetzung untersucht, mit realen Fallbeispielen erläutert und es ist Zeit für Diskussion.         Fr., 31. Juli 2020   08:30 – 13:00 CEST   Zum Kalender hinzufügen   Online-Event   Veranstalter von Enterprise Blockchain – ein realistischer Blick auf Kosten/Nutzen   Iceseminars ist das Wissenstool der Unternehmensberatung Iceventure.\n\nDer Ansatz für unser Programm basiert auf den Erfahrungen aus der Unternehmensberatung. In diesem Bereich, immer an der Schnittstelle zwischen Wissenschaft und Geschäftsalltag, ist der rasante Wandel, in dem wissensbasierte Produkte und Dienstleitungen stehen, besonders offensichtlich. Aus diesen Gründen sind Filter mehr als notwendig.   Diese Herausforderung löst Iceseminars mit seinem Angebot, dass sich an zwei Achsen ausrichtet:\nTechnische Fachthemen aus Wachstumssektoren und prozessorientierte Themen, die Ihnen ermöglichen Marktentwicklungen in ihrem Kontext zu deuten.\nSeminarthemen sind z.B. Enterprise IT, Technologieenchemische Energiespeicher, Open Innovation, Software as a Service und Geschäftsmodelle im Überinformationszeitalter.   Das Angebot wird durch Inhouseminare und die gezielte Auswahl der Referenten abgerundet.   © 2020 Eventbrite   \n                    Ihre E-Mail wird nur vom Eventveranstalter gesehen. Datenschutzrichtlinien anzeigen\n                   Outlook-Kalender   Google-Kalender   Apple-Kalender   Yahoo! Kalender         ","Link":"https://www.eventbrite.de/e/enterprise-blockchain-ein-realistischer-blick-auf-kostennutzen-tickets-109956544986?aff=ebdssbonlinesearch"},{"Title":"Enterprise Blockchain – ein realistischer Blick auf Kosten/Nutzen","Date":"So., 6. Sep. 2020 08:30 CEST","Price":"Ab 478,71 €","Information":"                        Der Fokus liegt im Gegensatz zu anderen Angeboten nicht auf einer generellen Beschreibung der Blockchain-Technologie oder dem eventuellen Potential möglicher Use-Cases im Zeitraum der nächsten 3-10 Jahre.   Stattdessen liegt er auf den gegenwärtigen, konkreten Kosten/Nutzen-Überlegungen und Stand der Technik, die für konkrete Anwendungen jenseits von ersten Prototypen relevant sind.   So liefert das Seminar einen realistischen Überblick über das Anwendungspotential und deckt die Schnittmenge zwischen technologischen und strategischen Überlegungen ab. Der Kernpunkt der Technologie Enterprise Blockchain „dezentral“ wird zudem in Hinblick auf die Unternehmensstrategie sowie Umsetzungsfragestellungen in einer bestehenden Wettbewerbslandschaft beschrieben und geprüft.   Die technologischen Möglichkeiten und Begrenzungen werden analysiert und in den Kontext kommerzieller Anwendung gestellt sowie offene Fragen angesprochen. Eine Checkliste der wichtigsten Faktoren zur Nachverfolgung wird ebenso eingeführt.   Die Informationen insbesondere zu Kosten und dem Stand der Technik basieren auf der von Iceventure durchgeführten Enterprise Blockchain Studie 2018. Dies ist die erste Studie, die die Betrachtung von Total Cost of Ownership anwendet und alle technischen Elemente untersucht.      Das Seminar gliedert sich in vier Teile. Zunächst wird an das Thema Enterprise Blockchain herangeführt und die Unterschiede zur ursprünglichen Blockchain-Technologie dargelegt. Im zweiten Teil werden die Eigenschaften, der aktuelle Stand, technologischen Probleme und Anwendungen der Enterprise Blockchain detailliert beschrieben. Auch wird eine Übersicht über aktuelle Aktivitäten wie z.B. Konsortien und Serviceanbietern gegeben. Im dritten Abschnitt wird die Enterprise Blockchain in den Kontext des Marktes und der Industrien gesetzt und die üblichen Aussagen des revolutionären Potentials der Blockchain geprüft. Zuletzt werden verschiedene gängige Use Cases (EV-Ladeinfrastruktur, Supply Chain, Finanzen) im Hinblick auf praktische Umsetzung untersucht, mit realen Fallbeispielen erläutert und es ist Zeit für Diskussion.         So., 6. September 2020   08:30 – 13:00 CEST   Zum Kalender hinzufügen   Online-Event   Veranstalter von Enterprise Blockchain – ein realistischer Blick auf Kosten/Nutzen   Iceseminars ist das Wissenstool der Unternehmensberatung Iceventure.\n\nDer Ansatz für unser Programm basiert auf den Erfahrungen aus der Unternehmensberatung. In diesem Bereich, immer an der Schnittstelle zwischen Wissenschaft und Geschäftsalltag, ist der rasante Wandel, in dem wissensbasierte Produkte und Dienstleitungen stehen, besonders offensichtlich. Aus diesen Gründen sind Filter mehr als notwendig.   Diese Herausforderung löst Iceseminars mit seinem Angebot, dass sich an zwei Achsen ausrichtet:\nTechnische Fachthemen aus Wachstumssektoren und prozessorientierte Themen, die Ihnen ermöglichen Marktentwicklungen in ihrem Kontext zu deuten.\nSeminarthemen sind z.B. Enterprise IT, Technologieenchemische Energiespeicher, Open Innovation, Software as a Service und Geschäftsmodelle im Überinformationszeitalter.   Das Angebot wird durch Inhouseminare und die gezielte Auswahl der Referenten abgerundet.   © 2020 Eventbrite   \n                    Ihre E-Mail wird nur vom Eventveranstalter gesehen. Datenschutzrichtlinien anzeigen\n                   Outlook-Kalender   Google-Kalender   Apple-Kalender   Yahoo! Kalender         ","Link":"https://www.eventbrite.de/e/enterprise-blockchain-ein-realistischer-blick-auf-kostennutzen-tickets-115025965760?aff=ebdssbonlinesearch"},{"Title":"Blockchain in Logistics and the Supply Chain","Date":"Di., 1. Sep. 2020 14:00 CEST","Price":"Kostenlos","Information":"                        What you will learn:      About the speakers:   Geoff Taylor is a senior software engineer at ChainPoint, specialized in developing solutions that implement digital Chain of Custody models. Geoff has a strong interest in utilizing modern and emerging technologies, such as blockchain, to increase collaboration in supply chains whilst reducing cost and risk.   Luca Gelsomino is a senior researcher at Windesheim University of Applied Sciences in the Netherlands, as well as the academic director of the Supply Chain Finance Community. As such, he takes care of the relationship of the Community with Universities around the globe, as well as other academic partners. Luca got a PhD in SCF from Politecnico di Milano (Italy) in 2016, where he has also been the director of the permanent SCF research initiative of the School of Management, the “Osservatorio Supply Chain Finance”. He authored scientific publications on the topic of SCF. His current research interests involve the integration of Logistics and Finance across supply chains, specifically focused on the role of innovative information technologies.            Online Event   Organizer of Blockchain in Logistics and the Supply Chain   This site contains all the business support training that is available for SMEs to sign up to as part of the Blockstart programme.   © 2020 Eventbrite   \n                    Your email will only be seen by the event organizer. View privacy policy.\n                   Outlook Calendar   Google Calendar   Apple Calendar   Yahoo Calendar   You will be notified by email one hour before the onsale. Reminders can be managed from the event listing.   Events are social. Allow Facebook friends to see your upcoming events?   Please help Eventbrite investigate this event by providing information about why you're reporting it.","Link":"https://www.eventbrite.be/e/blockchain-in-logistics-and-the-supply-chain-tickets-112075113682?aff=ebdssbonlinesearch"},{"Title":"Blockchain Startup Hackathon Webinar","Date":"Di., 4. Aug. 2020 13:00 CEST + 3 weitere Events","Price":"Kostenlos","Information":"                              Online Event   © 2020 Eventbrite   \n                    Your email will only be seen by the event organizer. View privacy policy.\n                   Outlook Calendar   Google Calendar   Apple Calendar   Yahoo Calendar   You will be notified by email one hour before the onsale. Reminders can be managed from the event listing.   Events are social. Allow Facebook friends to see your upcoming events?   Please help Eventbrite investigate this event by providing information about why you're reporting it.","Link":"https://www.eventbrite.com/e/blockchain-startup-hackathon-webinar-tickets-106562828288?aff=ebdssbonlinesearch"},{"Title":"The Blockchain Story: Make in India","Date":"So., 2. Aug. 2020 10:30 CEST","Price":"Kostenlos","Information":"                           We will have a week-long Case Competition followed by the main virtual summit where top blockchain and crypto experts will speak and share their opinion on the Crypto Industry in India and how SMEs can leverage it.      More details at : Crypto Trends         Sun, August 2, 2020   10:30 AM – 2:30 PM CEST   Add to Calendar   Online Event   © 2020 Eventbrite   \n                    Your email will only be seen by the event organizer. View privacy policy.\n                   Outlook Calendar   Google Calendar   Apple Calendar   Yahoo Calendar   You will be notified by email one hour before the onsale. Reminders can be managed from the event listing.   Events are social. Allow Facebook friends to see your upcoming events?   Please help Eventbrite investigate this event by providing information about why you're reporting it.","Link":"https://www.eventbrite.com/e/the-blockchain-story-make-in-india-tickets-112180859972?aff=ebdssbonlinesearch"},{"Title":"The Future of Blockchain: Challenges and Opportunities","Date":"Mi., 2. Sep. 2020 20:00 CEST","Price":"Ab 49,00 CA$","Information":"                        Eventbrite's fee is nonrefundable.   This module is designed to provide you with a foundational background and understanding of the future of the emerging technology called Blockchain.   This workshop is the last in a series of Blockchain workshops by UCW.   Each full workshop is two hours in length (the free introductory workshop is 60 minutes) and participants will get a Certificate of Completion from UCW for each full workshop completed. All workshops will be available online to participants for a limited period of time after the live event.   The workshops can be taken individually or as a pathway to a Certificate of Achievement for completing all five workshops through the Canadian College of Technology and Business (CCTB).   At the end of the workshops, attendees should leave with the knowledge and vocabulary needed to handle blockchain and cryptocurrency in professional situations. They will also acquire the tools necessary to develop their organization’s blockchain and/or cryptocurrency strategy and successfully promote it. For the management of the firm, having staff with such knowledge and expertise increases the probability of creative situations where opportunities can be extended to clients.   These are the other workshops available in the series.   Introduction to Blockchain - 11 am (PDT) July 29, 2020   This workshop is designed to provide the student with a foundational background and understanding of the emerging technology called Blockchain and Cryptocurrencies and further to spark interest in the biggest technology since the internet   Introduction to Blockchain Networks - 11 am (PDT) Aug. 12, 2020   This module provides learners with information on various types of Blockchain Networks including public, private, consortium and permissioned networks. What Blockchain networks are used for, the value they bring to business and society and how networks differ from each other.   Introduction to Blockchain Platforms - 11 am (PDT) Aug. 19, 2020   This two hour workshop provides learners with an introduction to the specific information related to Blockchain platforms including Hyper Ledger, Bitcoin and Ethereum.   Cryptocurrencies and the Digital Economy - 11 am (PDT) Aug. 26, 2020   This module is designed to provide you with a foundational background and understanding Cryptocurrencies, and the Digital Economy.   The Future of Blockchain: Challenges and Opportunities - 11 am (PDT) Sept. 2, 2020   This module is designed to provide you with a foundational background and understanding of the future of the emerging technology called Blockchain.   Learn more                                                                     ","Link":"https://www.eventbrite.ca/e/the-future-of-blockchain-challenges-and-opportunities-tickets-114199694360?aff=ebdssbonlinesearch"},{"Title":"Certified Blockchain Foundations (Online)","Date":"Mo., 3. Aug. 2020 15:00 CEST","Price":"Kostenlos","Information":"                           The purpose of this course is to provide students with a fundamental understanding of the technology and potential use cases. The instruction learning objectives for this course are:      Introduce the history of bitcoin and blockchain technology.   Discuss why cryptocurrencies and blockchain technologies are important.   Provide a basic understanding of cryptocurrencies.   Provide a basic understanding of blockchain technology.   Introduce legal and regulatory considerations.   Discuss blockchain use cases, benefits, and risks.      The cost of this 2-day class is $199   Register HERE: https://www.gbaglobal.org/event/gba-certified-blockchain-foundations-online-2/         Mon, Aug 3, 2020, 3:00 PM –   Tue, Aug 4, 2020, 8:00 PM CEST   Add to Calendar   Online Event   Organizer of Certified Blockchain Foundations (Online)   Gerard is a Portfolio Manager and has three organizations in his portfolio. One company provides consulting services to large organizations and the other business provides support to individuals who want to start a business. Gerard also leads an industry association called Blockchain Professionals. He travels all over the world speaking in public, consulting and evaluating organizations.   Gerard has a passion to help individuals and organizations succeed. He has helped organizations win business, develop innovative techniques and capabilities, improve processes, quality and profitability. Gerard also helps individuals start and successfully run e-commerce businesses.   Gerard is a CMMI High Maturity Lead Appraiser and Certified Instructor for both the development and services models. He travels around the world helping individuals and organizations succeed. He is also a Blockchain consultant.   © 2020 Eventbrite                        ","Link":"https://www.eventbrite.com/e/certified-blockchain-foundations-online-tickets-114619828994?aff=ebdssbonlinesearch"},{"Title":"Blockchain & Cybersecurity for the Future","Date":"Do., 17. Sep. 2020 16:30 CEST","Price":"Kostenlos","Information":"                        FSO Knowledge Xchange has gathered the best and brightest across the industry from various business lines such as insurance, technology, and security firms, education, and representatives of the government. Our thought leaders will look at the advantages of Blockchain and address cyber-risk-related topics that they have faced and shared valuable insights on how they have responded to remain protected and compliant in the current environment.   Our Topics include:   Implementing a data-driven security strategy         Thu, September 17, 2020   4:30 PM – 6:00 PM CEST   Add to Calendar   Online Event   Organizer of Blockchain & Cybersecurity for the Future   FSO Knowledge Xchange is a global research and information hub providing insights to the banking, insurance, and capital markets industry.   FSOkx’s mission is to leverage our media, research, events, and advisory services channels to empower senior-level financial industry executives with the knowledge they need to optimize global resources, achieve operational excellence, guard against technology obsolescence, innovate and improve business processes, adopt best practices, and transform their organizations. Armed with the knowledge that FSOkx makes available to our membership community, financial services executives are better prepared to meet the challenges of risk management, compliance, economic volatility, product commoditization, and decreased margins.   © 2020 Eventbrite   \n                    Your email will only be seen by the event organizer. View privacy policy.\n                   Outlook Calendar   Google Calendar   Apple Calendar   Yahoo Calendar   You will be notified by email one hour before the onsale. Reminders can be managed from the event listing.   Events are social. Allow Facebook friends to see your upcoming events?   Please help Eventbrite investigate this event by providing information about why you're reporting it.","Link":"https://www.eventbrite.com/e/blockchain-cybersecurity-for-the-future-tickets-115055006622?aff=ebdssbonlinesearch"},{"Title":"LONDON BLOCKCHAIN FOUNDATION: Membership","Date":"Mi., 6. März 2019 18:00 CET","Information":"","Link":""},{"Title":"Blockchain Innovations in Space and the Workplace","Date":"Do., 30. Juli 2020 17:00 CEST","Price":"Kostenlos","Information":"                        As private space exploration continues to become a reality, it is an opportune moment to discuss the nature of blockchain innovations related to space. As we have discussed previously in conversations about governance, hospitality, and education amongst many more, blockchain is rapidly innovating many industry’s supply chains, workplaces, and financial interactions.    Blockchain technology is beginning to play a vital role in the space industry and exploration. Tokenizing space resources such as orbits, satellites, spacecraft, asteroids and other space objects is only a small part of the role blockchain can and is  playing...   Through continued exploration and application, blockchain can result in a wholesale change in practices as important to life as agriculture, and fundamentally change the way we eat, invest and work.    Join us on July 30th to see how blockchain is bringing promising innovations both in space and on terra firma!      Speakers:    Abhishek Raju   Founder and CEO of SatSure AG, Abhishek has a long history of innovation within the aerospace communications vertical.  SatSure is a bespoke geospatial big data platform that combines satellite imagery, proprietary algorithms, with weather, IoT, drone imagery, social and economic datasets, and cadastral amongst others to generate near real time location specific insights that are changing how business can be done.       Surya Narayan Saha   Surya Saha is a senior risk professional in the insurance industry with deep interest in Blockchain and Insurtech. He is also the author of \"The Digital Choices\" – a book focused on digital transformation - an organizations journey through a digitally driven strategy. In addition to this, Surya is the steering committee member of the Europe India Centre for Business Industry largely focused on Europe-India Fintech related developments. Surya is also the Member of the Board of the Hope Foundation, Ireland and India, where he is working towards blockchain implementation for social transformation in Kolkata. Lastly, he is the founder of The Insurtech Story (an initiative started to demonstrate and debate the global insurtech advancements through experts view and real life cases).  Academically, Surya is currently pursuing his PhD in enterprise blockchain researching on blockchain based business models to revamp the insurance claims process in order to improve RoI and process efficiency. Prior to this, he has completed his master in business excellence from the University of Warwick in the UK specializing in process improvements and Six Sigma.      Maria Mateo Iborra   Maria Mateo has been in the space and satellite communications industry since 2005. She has a masters in Telecommunication Engineering, masters in satellite communications and executive MBA. Maria is also a serial entrepreneur and investor, having started ventures since she was 16 and entering in blockchain in 2015. She co-founded IBISA, an Insurtech start-up that enables the next generation of insurance for agriculture. She is also Affiliate Partner in True Global Ventures, mentor in Founder Institute and advisory board at WEF Global Shapers Community Luxembourg. Maria is an inquisitive, creative and objective oriented person interested in combining new technologies to advance as a society and create sustainable value and we are excited to hear her informed perspective on the future of blockchain in space and a variety of other industries.      Samson Williams   Principal consultant at Axes and Eggs, Samson focuses on solving human problems in operations, technology and finance throughout Dubai, Saudi Arabia, Dublin, Indochina, the USA and space.  His problem solving specialties include emerging technology adoption and crisis communications.  Co-author of the soon-to-be-released \"Blockchain and the Space Economy\" book with George Pullen, Samson is always pushing boundaries.       Richard Ells   Richard Ells balances over 28 years of from-the-ground-up experience with a continuing drive for innovation within the spheres of internet technologies and software. His latest venture is the runaway success cryptocurrency known as Electroneum with a focus on mobile ubiquity. The main goal of Electroneum is to bring simplicity and ease of access to cryptocurrency, allowing mass adoption and the empowerment of a huge new audience of mobile users in the developing world, who, until now, have mostly been unable to use a digital payment method, but now can now top off their phones with just about every major carrier using Electroneum! With more than 4 million registered users worldwide, Electroneum has already achieved enormous viral growth since its launch in December 2017. Its ETN-powered freelance platform AnyTask.com, which is still in BETA mode, has also been a success with over 460,000 registered users and 7,500 tasks listed across dozens of digital services categories.  Electroneum is the only crypto that has enabled its users to top-up electricity and mobile airtime and data top-ups from within the ETN app.  Corporate interest in this vast new market has been tremendous. It has led to agreements with large enterprises that are taking their first tentative steps into the commercialization of cryptocurrency.  We are excited to learn about any future applications of blockchain and how the blockchain enabled AnyTask platform is changing lives around the globe!   (Please note:  This information is for educational purposes only and does not constitute a recommendation for investment or any other form of engagement.)   Please also note the following:    You must register through Eventbrite to get a confirmation email containing the Zoom details for the event. Once registered, you will receive a confirmation email with the Zoom link and password.                                                                   ","Link":"https://www.eventbrite.com/e/blockchain-innovations-in-space-and-the-workplace-tickets-114900873606?aff=ebdssbonlinesearch"},{"Title":"Blockchain Patents and Innovation (Online Panel)","Date":"Fr., 28. Aug. 2020 15:00 CEST","Price":"Kostenlos","Information":"                        Blockchain Patents and Innovation (Online Panel)      DATE & TIME   Date: Friday, August 28, 2020   Time: 15h00-16h00   Mode: online talk via Zoom; Zoom dial-in URL will be sent previous to the online talk      SPEAKERS   1. Moderator: Prof. Dr. Philipp Sandner (Frankfurt School Blockchain Center)   2. Justus Kreuels (Co-Founding Partner, karo IP)   3. Marc Kaufman (Partner, Rimon Law)   4. Tony Oehm (CEO, AZHOS)      ABOUT DISRUPT NETWORK   Blockchain and community building. This is our mission. The Corona virus did not make things easier for us, but we will now move our events online to help education and dissemination in the blockchain area.      You want to become our speaker? We aim at 500+ video conference participants per talk. Write to: team@disrupt-network.io      HOW TO STAY UPDATED   We do online talks and online panel discussions 2x per week. We frequently post our next events on Twitter and on LinkedIn. Follow us to stay up to date:      LANGUAGE   This talk will be held in English.                                                                        ","Link":"https://www.eventbrite.de/e/blockchain-patents-and-innovation-online-panel-tickets-112628071594?aff=ebdssbonlinesearch"},{"Title":"The Babylon Project by World Blockchain Hackathon","Date":"Fr., 9. Okt. 2020 19:00 CEST","Price":"Kostenlos","Information":"                        This hackathon will focus on teaching development skills in blockchain and building a global developer community.   Application & Participation   * Participation is 100% free to all attendees   * Every participant must apply on the website.Tickets from third party websites such as Eventbrite are not valid and does not guarantee participation in the hackathon.   * Selected applicants will receive participation acknowledgement email from us & invitation to join the private Discord channel.   72-hours of Magic   The hackathon will cover the latest Blockchain technologies, research, applications, and development. Workshops, panels & mentorship by top experts will help you learn more about this amazing technology.   Prices, Funding, Networking & Employment Opportunities   During the hackathon, partner prices will be won, investors to talk with and recruiters looking to hire global talents.   Certificate of Participation   All participants will receive verifiable and lifelong certificates that will be recorded on a public blockchain.   Alone or with a Team   * Single participants can find or create a team in the discord channel before the hackathon starts.   * Participants can attend in teams. A team should have 10 participants(max) & 4 participants(min)      More information is on the website https://worldblockchainhackathon.com/         Fri, Oct 9, 2020, 7:00 PM –   Mon, Oct 12, 2020, 3:00 AM CEST   Add to Calendar   Online Event   Organizer of The Babylon Project by World Blockchain Hackathon                           ","Link":"https://www.eventbrite.com/e/the-babylon-project-by-world-blockchain-hackathon-tickets-110838701540?aff=ebdssbonlinesearch"},{"Title":"Blockchain Healthcare Course GBA Global","Date":"Di., 25. Aug. 2020 19:00 CEST","Price":"Ab 400,00 $","Information":"                        Eventbrite's fee is nonrefundable.   Attend this course and start your Blockchain Healthcare Career Journey!         Tue, Aug 25, 2020, 7:00 PM –   Wed, Aug 26, 2020, 2:00 AM CEST   Add to Calendar   Online Event   Contact the organizer to request a refund.   Eventbrite's fee is nonrefundable.   Organizer of Blockchain Healthcare Course GBA Global       © 2020 Eventbrite   \n                    Your email will only be seen by the event organizer. View privacy policy.\n                   Outlook Calendar   Google Calendar   Apple Calendar   Yahoo Calendar   You will be notified by email one hour before the onsale. Reminders can be managed from the event listing.   Events are social. Allow Facebook friends to see your upcoming events?   Please help Eventbrite investigate this event by providing information about why you're reporting it.","Link":"https://www.eventbrite.com/e/blockchain-healthcare-course-gba-global-tickets-110065344408?aff=ebdssbonlinesearch"},{"Title":"Blockchain & AI Hackathon 2020","Date":"Fr., 13. Nov. 2020 15:00 CET","Price":"Kostenlos","Information":"                           Online Event   Organizer of Blockchain & AI Hackathon 2020   Advocating Talent through Innovation      TH.0 strives on being fresh, dynamic, and forward-thinking towards talent through innovation for the tech echo system.      Our hackathons span all major industry sectors whilst fostering a community of like-minded enthusiasts. We endeavour to offer collaborations for all talented and innovative participants from across the globe to join us in our passion for combating the most pressing topics by coming together to push the boundaries of technical innovation.      We believe in offering a centre stage to all TH.0's members to build upon their knowledge, skills, and professional network.      Our aim is to inspire businesses to identify disruptive ideas via the engagement of untapped talent pools within their own industry, as well as encourage them to explore unique approaches towards creative ideas whilst building a lasting presence.   © 2020 Eventbrite   \n                    Your email will only be seen by the event organizer. View privacy policy.\n                   Outlook Calendar   Google Calendar   Apple Calendar   Yahoo Calendar   You will be notified by email one hour before the onsale. Reminders can be managed from the event listing.   Events are social. Allow Facebook friends to see your upcoming events?   Please help Eventbrite investigate this event by providing information about why you're reporting it.","Link":"https://www.eventbrite.co.uk/e/blockchain-ai-hackathon-2020-tickets-111280260254?aff=ebdssbonlinesearch"},{"Title":"Decentralized Blockchain & Cryptocurrency Revolution","Date":"Fr., 31. Juli 2020 18:00 CEST + 22 weitere Events","Price":"Kostenlos","Information":"                        It has never been more important for enterprises and individuals to embrace this transformation.   However, the cryptocurrency & blockchain domain is multifaceted & evolving very rapidly – understanding the technology & its market dynamics can be a challenge, especially for the non-tech savvy & businesses entering this domain.   This podcast aims to introduce people to this technological space - what is happening & why.   These weekly podcasts provide a great platform for particpants to ask questions.   Listen-Ask-Learn & be prepared for the digital transformation      Refer to CryptoVie - Blockchain 101 for more information on B101 on-site 360° educational series & its creator.         Online Event   Organizer of Decentralized Blockchain & Cryptocurrency Revolution   © 2020 Eventbrite   \n                    Your email will only be seen by the event organizer. View privacy policy.\n                   Outlook Calendar   Google Calendar   Apple Calendar   Yahoo Calendar   You will be notified by email one hour before the onsale. Reminders can be managed from the event listing.   Events are social. Allow Facebook friends to see your upcoming events?   Please help Eventbrite investigate this event by providing information about why you're reporting it.","Link":"https://www.eventbrite.ca/e/decentralized-blockchain-cryptocurrency-revolution-tickets-114764569918?aff=ebdssbonlinesearch"},{"Title":"Blockchain Technologies: Business Innovation and Application","Date":"Do., 3. Sep. 2020 15:00 CEST","Price":"Kostenlos","Information":"                        With a focus on its organizational opportunities and limitations, the program will equip you with the tools to leverage blockchain technology to drive innovation and efficiency in your business.   On completion, you’ll be able to implement a blockchain-based solution to address a business problem within your own context.   On completion of this course, you’ll walk away with:      A deeper understanding of the capabilities of blockchain technology, enabling you to assess which business problems it can solve   A blockchain-based strategy that addresses a business challenge within your industry   A thorough understanding of how blockchain technology lowers the cost of verification and the cost of networking   Knowledge of how blockchain powers applications like bitcoin and other token-based initiatives         Thu, September 3, 2020   3:00 PM – 6:30 PM CEST   Add to Calendar   Online Event   Organizer of Blockchain Technologies: Business Innovation and Application   © 2020 Eventbrite   \n                    Your email will only be seen by the event organizer. View privacy policy.\n                   Outlook Calendar   Google Calendar   Apple Calendar   Yahoo Calendar   You will be notified by email one hour before the onsale. Reminders can be managed from the event listing.   Events are social. Allow Facebook friends to see your upcoming events?   ","Link":"https://www.eventbrite.com/e/blockchain-technologies-business-innovation-and-application-tickets-114802673888?aff=ebdssbonlinesearch"},{"Title":"Understand Blockchain , Bitcoin and Other Cryptocurrencies","Date":"Do., 30. Juli 2020 11:50 CEST + 129 weitere Events","Price":"Kostenlos","Information":"                           Here in Kenya the Blockchain and Artificial Intelligence Task force recently concluded their report in which they recommended that cryptocurrencies be adopted in the country for financial inclusion of all. The full report can be viewed here: http://www.ict.go.ke/blockchain.pdf      Christine Lagarde, the president of the European Central Bank and immediate head of the International Monetary Fund (IMF) early this year warned of a looming financial crisis reminiscent of the 2008-09 financial crisis that caused a global economic meltdown. The question is how well are you prepared? Many analysts have agreed that Bitcoin and cryptocurrencies will be the perfect hedging over the recession.      What You Will Learn:      What is Bitcoin and how does it work?   What is Blockchain?   How can you invest in Bitcoin & other alternative Cryptocurrencies?   How can you accumulate digital currencies and expand your wealth portfolio?   How can you benefit from Bitcoin and make profits?      RSVP: CHRISTINE: 0723630986         Online Event   Organizer of Understand Blockchain , Bitcoin and Other Cryptocurrencies   © 2020 Eventbrite   \n                    Your email will only be seen by the event organizer. View privacy policy.\n                   Outlook Calendar   Google Calendar   Apple Calendar            ","Link":"https://www.eventbrite.com/e/understand-blockchain-bitcoin-and-other-cryptocurrencies-tickets-99004309555?aff=ebdssbonlinesearch"},{"Title":"T175 Blockchain Development Orientation","Date":"Di., 1. Sep. 2020 17:00 CEST","Price":"Kostenlos","Information":"                        Take advantage of all the online and virtual support sessions and events leading up to your program orientation by visiting the GBC orientation pages.   This is your opportunity to get things done in advance of your first day. Topics include how to get started, get involved, succeed, and take care of your well-being while studying remotely. Check out the calendar of events for more engagement and support session.         Tue, September 1, 2020   5:00 PM – 6:00 PM CEST   Add to Calendar   Online Event   Organizer of T175 Blockchain Development Orientation   © 2020 Eventbrite   \n                    Your email will only be seen by the event organizer. View privacy policy.\n                   Outlook Calendar   Google Calendar   Apple Calendar   Yahoo Calendar   You will be notified by email one hour before the onsale. Reminders can be managed from the event listing.   Events are social. Allow Facebook friends to see your upcoming events?   Please help Eventbrite investigate this event by providing information about why you're reporting it.","Link":"https://www.eventbrite.ca/e/t175-blockchain-development-orientation-tickets-114610039714?aff=ebdssbonlinesearch"},{"Title":"Certified Blockchain Professional Developer (CBPD)","Date":"Do., 6. Aug. 2020 15:00 CEST","Price":"Ab 1.000,00 $","Information":"                        Eventbrite's fee is nonrefundable.   Overview   A Certified Blockchain Professional Developer knows how to develop integrated smart contracts and deploy them on servers. A Certified Blockchain Professional Developer can build Blockchain-based applications for enterprises and businesses in multiple Blockchain Technologies. The CBPD credential certifies individuals in the Blockchain development from a vendor-neutral perspective.   Learning Objectives      For more information, please contact us: info@cyberbahnit.com            Thu, Aug 6, 2020, 3:00 PM –   Sun, Aug 9, 2020, 11:00 PM CEST   Add to Calendar   Online Event   Contact the organizer to request a refund.   Eventbrite's fee is nonrefundable.   Organizer of Certified Blockchain Professional Developer (CBPD)   CyberBahn Federal Solutions LLC is a corporate training provider. We provide corporate training in Agile and Blockchain technologies. Our blended learning approach drives learner engagement with a high completion rate. We blend use cases and real work experience, with classroom and labs to get results.  Our courses are reviewed by industry experts, accredited, and updated several times a year based on the latest research and trends.   To download our agile course catalog:    https://www.cyberbahntas.com/public/storage/pages/2020011713CyberBahn_Agile_Training5e21b4a16c499.pdf    To download our blockchain course catalog:     https://www.cyberbahntas.com/public/storage/pages/2020012011CyberBahn_Blockchain_Training5e259473bd3f4.pdf   © 2020 Eventbrite   \n                    Your email will only be seen by the event organizer. View privacy policy.\n                                     ","Link":"https://www.eventbrite.com/e/certified-blockchain-professional-developer-cbpd-tickets-88792754519?aff=ebdssbonlinesearch"},{"Title":"Black Blockchain Summit 2020","Date":"Sa., 12. Sep. 2020 07:30 CEST","Price":"Kostenlos","Information":"                        The 2020 Black Blockchain Summit brings together Blockchain enthusiasts, entrepreneurs and innovators to discuss a myriad of challenges facing Black communities of the diaspora and the continent of Africa.   The objective of the 2020 Black Blockchain Summit is to generate innovative and lasting solutions that disrupt our currently unsustainable position within emergent technologies. We seek to bring lasting prosperity and independence via blockchain solutions as envisaged by freedom fighters and liberators in the “Arusha Declaration”.   The 2020 Black Blockchain Summit conference agenda is diverse; our speakers will discuss blockchain technology solutions in BARAZA format, an interactive debate format of the Swahili language. Check out our full agenda at:   www.blackblockchainsummit.com   We believe, through diligent use of technology; problems facing Black societies globally can be mitigated leveraging blockhain technology. Come and be a part of the discourse!   FAQsAre minimum age requirements to enter the event?There are no minimum age requirements.   I am a newbie to blockchain tech, what can I bring into the event?An open mind, a listening ear, and a commitment to the liberation of black people of the diaspora and africa via emergent technology. I am an expert with blockchain technology, will there be opportunities to connect and discuss with people who are more than well versed within the community?Yes.         Sat, September 12, 2020   7:30 AM – 5:30 PM CEST   Add to Calendar   Online Event   Organizer of Black Blockchain Summit 2020   © 2020 Eventbrite   \n                    Your email will only be seen by the event organizer. View privacy policy.\n                   Outlook Calendar   Google Calendar   Apple Calendar   Yahoo Calendar   You will be notified by email one hour before the onsale. Reminders can be managed from the event listing.   Events are social. Allow Facebook friends to see your upcoming events?   Please help Eventbrite investigate this event by providing information about why you're reporting it.","Link":"https://www.eventbrite.com/e/black-blockchain-summit-2020-tickets-105232735946?aff=ebdssbonlinesearch"},{"Title":"wbsLive Webinar:  The Real Business of Blockchain","Date":"Do., 6. Aug. 2020 18:00 CEST","Information":"","Link":""},{"Title":"Online Seminar – Blockchain Basics – Introduction to the Technology","Date":"Di., 11. Aug. 2020 14:00 CEST","Price":"Kostenlos","Information":"                           Stefan Schmitt works as a project manager for the Frankfurt School Blockchain Center and the product owner of the Frankfurt School Blockchain Academy. Furthermore, he drives standardization of the token markets as a project manager at ITSA. Mr. Schmitt holds a Master in Finance (M.Sc.) from the Frankfurt School of Finance and Management.      Location: Zoom (access data will be emailed shortly before the start of the event)   Date: Tuesday, August 11th, 2020 14:00-15:00, CET   Language: English   Registration required via Eventbrite; dial-in via zoom (installation required); maximum number of participants: 300      2:00 pm - Introduction by Benjamin Schaub, Frankfurt School Blockchain Center   2:15 pm - Presentation by Stefan Schmitt, Frankfurt School Blockchain Center   2:45 pm - Q&A session   3:00 pm - End of the event      Required via Eventbrite; participants will receive the URL for the online-seminar in advance.      Frankfurt School Blockchain Center   E-Mail: team@fs-blockchain.de   Phone: +49 69 154 008-790   Web: www.fs-blockchain.de      About the Frankfurt School Blockchain Center   The Frankfurt School Blockchain Center (FSBC) is a think tank and research center primarily focusing on the implications of blockchain technology for companies and businesses. In addition to the development of blockchain prototypes, the center offers a platform for the exchange of knowledge and thought for decision-makers and startups as well as technology and industry experts. The FSBC sets new research impulses and develops education programs for students and executives. The center concentrates primarily on the areas of banking, energy, mobility, and the manufacturing industry.                                                            ","Link":"https://www.eventbrite.de/e/online-seminar-blockchain-basics-introduction-to-the-technology-tickets-113881831624?aff=ebdssbonlinesearch"},{"Title":"Blockchain Insights - LIVE Online Session FREE","Date":"Fr., 28. Aug. 2020 16:00 CEST","Price":"Kostenlos","Information":"                        Blockchain technology has been described as the biggest technical revolution since the Internet. Originally devised for the digital currency, Bitcoin, the tech community is now finding other potential uses for the technology that enables digital transactions without the use of intermediaries and ensures transparencies in digital asset movements.   Blockchain technology is expected to change a wide range of business sectors fundamentally, such as banks and finance, consumer goods, supply chain, medical, digital identity, legal services, etc. In this Webinar, the technical insight of the block chain technology will be deliberated.   Facilitator:   Md. Shamsul Haque   Head of Digital Innovation   LEADS Corporation Limited   Date: 28th August, 2020 Time: 8:00 pm to 10:00 pm         Fri, August 28, 2020   4:00 PM – 6:00 PM CEST   Add to Calendar   Online Event   Organizer of Blockchain Insights - LIVE Online Session FREE   Learnivo is an online learning platform that helps anyone learn software, technology and creative skills to achieve personal and professional goals.   © 2020 Eventbrite   \n                    Your email will only be seen by the event organizer. View privacy policy.\n                   Outlook Calendar   Google Calendar   Apple Calendar   Yahoo Calendar   You will be notified by email one hour before the onsale. Reminders can be managed from the event listing.   Events are social. Allow Facebook friends to see your upcoming events?   ","Link":"https://www.eventbrite.com/e/blockchain-insights-live-online-session-free-registration-113668242774?aff=ebdssbonlinesearch"},{"Title":"Exploring Blockchain in the Cultural Sector Online Conference","Date":"Fr., 16. Okt. 2020 10:00 CEST","Price":"Kostenlos","Information":"                        We invite researchers, professionals, students and artists to join us for this one-day online conference which includes speakers from across the world. Topics include:   Programme   We will be holding this conference online using Zoom with a series of panels and a keynote. Attendees are invited to join as many or as few sessions as they would like. Full programme can be found here.   Booking   Please register via Eventbrite so that we can include you in communications. Nearer the time, we will email attendees registration links for each individual session   This conference is supported by the AHRC (through the North West Consortium Doctoral Training Partnership Cohort Development Fund), Creative Manchester & Digital Futures            Fri, October 16, 2020   10:00 AM – 7:00 PM CEST   Add to Calendar   Online Event   © 2020 Eventbrite   \n                    Your email will only be seen by the event organizer. View privacy policy.\n                   Outlook Calendar   Google Calendar   Apple Calendar   Yahoo Calendar   You will be notified by email one hour before the onsale. Reminders can be managed from the event listing.   Events are social. Allow Facebook friends to see your upcoming events?   Please help Eventbrite investigate this event by providing information about why you're reporting it.","Link":"https://www.eventbrite.com/e/exploring-blockchain-in-the-cultural-sector-online-conference-tickets-109601990504?aff=ebdssbonlinesearch"},{"Title":"Diplomado Profesional Blockchain@Berkeley Fundamentals en Español","Date":"Sa., 15. Aug. 2020 15:30 CEST","Price":"Kostenlos","Information":"                        El diplomado se llevará a cabo en línea entre el 15 de agosto al 12 de septiembre de 2020, organizado por Blockchain@Berkeley y LUMIT Hub.   Todo aquel miembro que haya completado el taller será acreedor de un certificado digital en blockchain gracias a CINCEL acreditado por LUMIT Hub.      Blockchain@Berkeley es una de las comunidades educativas más respetadas a nivel mundial de blockchain y crypto, siendo su epicentro la Universidad de California, Berkeley, San Francisco. Considerada la mejor universidad pública de Estados Unidos y una de las mejores a nivel mundial en tecnología, investigación y negocios.   Sitio web de Blockchain@Berkeley: https://blockchain.berkeley.edu/      LUMIT Hub es uno de los ecosistemas blockchain más relevantes de México y LATAM, siendo un epicentro de eventos relevantes de la industria en los últimos años y representando a México y LATAM en la aceleración de Berkeley Blockchain Xcelerator (2019, San Francisco) y la ONU en la comisión de Blockchain for Impact (2018 y 2019, Nueva York).   Sitio web de LUMIT Hub: https://www.lumitblockchain.com/language/es/hub/      Lo que aprenderás   Blockchain Fundamentals es una introducción completa al espacio blockchain. Blockchain for Developers presenta las herramientas necesarias para convertirse en un desarrollador de blockchain de pila completa, con un enfoque en el desarrollo de contratos inteligentes de Ethereum y la pila de tecnología.   El espacio blockchain es una unión de logros técnicos innovadores y movimientos sociales fundamentales. Los temas técnicos incluyen los conceptos básicos de la criptografía y la economía, los componentes clave de Bitcoin y la miríada de ideas y tecnologías de blockchain recientemente desarrolladas. Socialmente, cubrimos la historia de la moneda digital y las leyes, organizaciones, tendencias y comunidades que componen el ecosistema. El objetivo de este curso es superar la curva de aprendizaje empinada de la tecnología blockchain, mirando más allá de las palabras de moda para desarrollar una comprensión profunda de las partes móviles de las facetas técnicas y no técnicas. Al final, comprenderá cómo funcionan las tecnologías blockchain y las instituciones, ideas e innovación que surgen de ellas.   Perspectivas de empleo   Debido a la alianza entre Blockchain@Berkeley y LUMIT Hub junto con aliados, hemos traído el taller desde San Francisco y traducido al español con el fin de tener un impacto benéfico a toda la comunidad blockchain de México y América Latina.      Gracias a los patrocinadores podremos llegar a más personas para difundir los fundamentos de la tecnología blockchain.   Al completar este diplomado junto con un examen final, serán acreedores de un certificado digital profesional registrado en blockchain por CINCEL acreditado por LUMIT Hub.                  Regístrate hoy mismo para apartar tu lugar y adquirir tu beca del 100%                                                               ","Link":"https://www.eventbrite.com.mx/e/diplomado-profesional-blockchainberkeley-fundamentals-en-espanol-tickets-109909664766?aff=ebdssbonlinesearch"},{"Title":"An Introduction to Substrate - Building Blockchains the Easy Way","Date":"Do., 6. Aug. 2020 18:00 CEST","Price":"Kostenlos","Information":"                        Learn how Substrate makes it easy to encapsulate your domain-specific logic in just a few lines of code and include it in a running blockchain in about 30 minutes.   In this live technical workshop, you will learn how Substrate and its meta-framework \"FRAME\" makes it easy to build a custom blockchain that comes fully loaded with best-in-class cryptographic algorithms from the researchers at the Web3 Foundation. Topics will include: the “Substrate and FRAME way” of thinking about blockchains, how to use FRAME to write custom blockchain logic in just a few lines of code, how to use Polkadot JS Apps UI and other ecosystem tools to interact with a Substrate-based chain, and the Substrate-based chains that Parity hosts and how they can be used as developer resources.   Who should attend: Blockchain developers who want to learn about the technical advantages of using Substrate for their blockchain solutions. No previous experience needed!   Speaker: Dan Forbes, Developer Advocate, Parity Technologies   Agenda (1 h):   Here’s what you are going to need to participate:   Substrate comes with everything you need to build your blockchain. By using Substrate’s pallets you can easily create what you want, or craft your own custom logic. Either way, Substrate makes building a blockchain far faster, easier, and safer than ever before.   Start hacking!   PLEASE REGISTER ON CROWDCAST https://parity.link/sLDUE   ****   Parity Technologies is committed to protecting and respecting your privacy.   To see how we use and share your personal data please see the privacy policy https://www.parity.io/privacy/         Thu, August 6, 2020   6:00 PM – 7:00 PM CEST   Add to Calendar   Online Event   Organizer of An Introduction to Substrate - Building Blockchains the Easy Way   © 2020 Eventbrite   \n                    Your email will only be seen by the event organizer. View privacy policy.\n                   Outlook Calendar   Google Calendar               ","Link":"https://www.eventbrite.com/e/an-introduction-to-substrate-building-blockchains-the-easy-way-tickets-114274522172?aff=ebdssbonlinesearch"},{"Title":"5 Day - BMW - Blockchain Mastery Workshop_III","Date":"","Price":"Ab 4,00 $","Information":"                        Day 1 (Monday): What is Blockchain & Cryptography + LIVE Q&A SESSION   Day 2 (Tuesday): Bitcoin Architecture, Bitcoin Monetary Policy, Consensus Mechanisms & Wallets and Exchanges + LIVE Q&A SESSION   (Wednesday): Break in case you have to catch up the previous modules   Day 3 ( Thursday) : Smart Contracts, DApps and DAO & Tokenization + LIVE Q&A SESSION   Day 4 (Friday) : Types of Blockchain & Use Cases of Blockchain + LIVE Q&A SESSION   Day 5 (Saturday) : Creation of wallets , ERC20 Token, FUTURE OF BLOCKCHAIN (ONLY LIVE SESSION)   So Total of 10 +4 Hrs of Workshop   PLUS   You are entitled to BONUS below:   - Complete Guidance Workbook/Handbook   - CheatSheet of Blockchain   - Use Cases of different Sectors   - Career Counselling on how to project yourself as Blockchain Expert in the Market   - Connect with Blockchain fund house - Chance to get funded for your Blockchain based idea (If any)   - & MUCH MORE!!!            Online Event   Contact the organizer to request a refund.   Eventbrite's fee is nonrefundable.   Organizer of 5 Day - BMW - Blockchain Mastery Workshop_III   © 2020 Eventbrite                        ","Link":"https://www.eventbrite.ca/e/5-day-bmw-blockchain-mastery-workshop-iii-tickets-114015136342?aff=ebdssbonlinesearch"},{"Title":"GBA Blockchain Legal Specialist Course (Online)","Date":"Mi., 5. Aug. 2020 15:00 CEST","Price":"Kostenlos","Information":"                           Many authors, writers, and speakers at conferences describe blockchain as transformative. But what does that mean? This course will address the impact of this technology on our regulations, laws, legal frameworks, institutions, and society.      Blockchain was first made popular via the Bitcoin Whitepaper. Soon after that other cryptocurrencies and use cases exploded into existence. These new forms of transactions and business processes have never been seen before. The concept of decentralized governance of a currency involving hundreds of billions of dollars in transactions without anyone in control was revolutionary. The idea that anyone could mint their own currency or create tokens that could be used globally and anonymously did not fit the existing legal and regulatory models.      This new “capability” allows retail banks to execute cross-border payments in seconds, without central banks and at lower costs. It allows for monetary transactions to exist outside of banking systems used by governments to monitor and influence economic activity. It erodes the government’s ability to control capital flight and potentially impacts every type of value transaction in society.   Are our current laws, rules, and systems adequate to manage this “transformational” technology? Attend this course to understand blockchain and the impact it will have on virtually every aspect of our legal, regulatory, and governance systems.      The cost for this one-day class is $99   REGISTER HERE:   https://www.gbaglobal.org/event/bc-230-blockchain-legal-specialist-online-4/         Wed, August 5, 2020   3:00 PM – 10:00 PM CEST   Add to Calendar   Online Event   Organizer of GBA Blockchain Legal Specialist Course (Online)   Gerard is a Portfolio Manager and has three organizations in his portfolio. One company provides consulting services to large organizations and the other business provides support to individuals who want to start a business. Gerard also leads an industry association called Blockchain Professionals. He travels all over the world speaking in public, consulting and evaluating organizations.   Gerard has a passion to help individuals and organizations succeed. He has helped organizations win business, develop innovative techniques and capabilities, improve processes, quality and profitability. Gerard also helps individuals start and successfully run e-commerce businesses.   Gerard is a CMMI High Maturity Lead Appraiser and Certified Instructor for both the development and services models. He travels around the world helping individuals and organizations succeed. He is also a Blockchain consultant.   © 2020 Eventbrite   \n                    Your email will only be seen by the event organizer. View privacy policy.\n                                     ","Link":"https://www.eventbrite.com/e/gba-blockchain-legal-specialist-course-online-tickets-114622033588?aff=ebdssbonlinesearch"},{"Title":"Postponed: Blockchain Technology:  Current Challenges of Cryptocurrency","Date":"Mi., 16. Sep. 2020 16:00 CEST","Information":"","Link":""},{"Title":"FREE WEBINAR - BLOCKCHAIN: DISRUPTING THE GLOBAL MARKET","Date":"Do., 30. Juli 2020 18:00 CEST","Price":"Kostenlos","Information":"                        How can blockchain help fight corruption in the public sector? What’s the latest news with distributed ledger tech? Can we stop money laundering from illegal wildlife trade cases using technology?   Corruption, money laundering, frauds, and breaches are out there.   We need to call our tech heroes to save the day:   Niklas will explain to us his distributed ledgers daily battles.   A covenant with the World Economic Forum has been agreed by Sebastian to fight corruption in the public sector. And Patrick will tell us how to tackle money laundering in the illegal wildlife trade using blockchain   \n\t      Thu, 30 July 2020   18:00 – 19:00 CEST   \n\t\t\t\t\t\t\t\t\t\t\t\tAdd to Calendar\n\t\t\t\t\t\t\t\t\t\t\t   Online Event   Organiser of FREE WEBINAR - BLOCKCHAIN: DISRUPTING THE GLOBAL MARKET   Kreativdistrikt is the Link between technology and developers.   Event creator   Events you might like:   © 2020 Eventbrite   \n                    Your email will only be seen by the event organiser. View privacy policy.\n                   Outlook Calendar   Google Calendar   Apple Calendar   Yahoo Calendar   You will be notified by email one hour before the onsale. Reminders can be managed from the event listing.   Events are social. Allow Facebook friends to see your upcoming events?   ","Link":"https://www.eventbrite.co.uk/e/free-webinar-blockchain-disrupting-the-global-market-tickets-114096928986?aff=ebdssbonlinesearch"},{"Title":"PRACTICAL USE OF BLOCKCHAIN THROUGH R3 CORDA","Date":"Sa., 8. Aug. 2020 11:00 CEST","Price":"Ab 300,00 £","Information":"                        ABOUT KAPIL SHARMA (https://www.linkedin.com/in/kapiluk/)   Global Technology Transformation executive with 20+ years extensive management experience (C-Suite Level) in large globally distributed Investment Banking and consulting environments, with a proven track record of initiating and delivering multiple global strategic initiatives.   I am also a visiting lecturer in Bournemouth University and recently completed a module for masters students on ‘Blockchain and Digital Futures’.   Specialties: Blockchain, Cloud, Transformation, Digital, Fintech, Lecturer and Author of multiple technology books.      COURSE OVERVIEW & PREREQUISITES   The objective of this unit is to develop the learner's skills and knowledge about the Blockchain technology and its usage. The material will be provided during the lecture along with case study/homework for the next lecture. This course is a mix of theory and practical case study.   • Students are expected to know basics of Linux and command line   • Basic knowledge of Cloud   • Access to laptop/desktop and good internet connectivity   INTENDED LEARNING OUTCOMES   Having successfully completed this unit the student is expected to:   1. Gain knowledge of the Blockchain technology and its key concepts.   2. Understand and evaluate different Blockchain use cases in real world scenario   3. Gain knowledge of R3 Corda, Setup R3 Corda Blockchain on your desktop or cloud and deploy a test app   LEARNING & TEACHING APPROACH   Online classes, case study, practical homework      COURSE CONTENT   1. Blockchain Fundamentals   What is Blockchain, Blockchain impact and potential for change around the world, understand how Blockchain is applied to all aspects of business, demonstrate some of the immediate Blockchain use cases in technology, business, and enterprise products and institutions, Blockchain objectives, transactions and blocks, trustless and distributed ledger.   2. Blockchain Use Cases and Implementation   Use case: Enterprise Blockchain implementations (JP Morgan’s Quorum, Corda, Ripple, HyperLedger), industry use cases for Blockchain, and the increasing regulations surrounding Blockchain.                                                                     ","Link":"https://www.eventbrite.co.uk/e/practical-use-of-blockchain-through-r3-corda-tickets-113259478148?aff=ebdssbonlinesearch"},{"Title":"Blockchain Gamer LIVE! Digital #1 [part of Pocket Gamer Connects Helsinki]","Date":"Mo., 14. Sep. 2020 10:00 CEST","Information":"","Link":""},{"Title":"Ethereum in the Enterprise 2020 - A  Virtual Conference from the EEA","Date":"Do., 30. Juli 2020 16:00 CEST","Information":"","Link":""},{"Title":"TruffleCon 2020 | Virtual Blockchain Developer Conference","Date":"Fr., 6. Nov. 2020 18:00 CET","Information":"","Link":""},{"Title":"Cryptocurrencies and the Digital Economy","Date":"Di., 25. Aug. 2020 20:00 CEST","Price":"Ab 49,00 CA$","Information":"                        Eventbrite's fee is nonrefundable.   This module is designed to provide you with a foundational background and understanding Cryptocurrencies, and the Digital Economy.   This workshop is the fourth in a series of Blockchain workshops by UCW.   Each full workshop is two hours in length (the free introductory workshop is 60 minutes) and participants will get a Certificate of Completion from UCW for each full workshop completed. All workshops will be available online to participants for a limited period of time after the live event.   The workshops can be taken individually or as a pathway to a Certificate of Achievement for completing all five workshops through the Canadian College of Technology and Business (CCTB).   At the end of the workshops, attendees should leave with the knowledge and vocabulary needed to handle blockchain and cryptocurrency in professional situations. They will also acquire the tools necessary to develop their organization’s blockchain and/or cryptocurrency strategy and successfully promote it. For the management of the firm, having staff with such knowledge and expertise increases the probability of creative situations where opportunities can be extended to clients.   These are the other workshops available in the series.   Introduction to Blockchain - 11 am (PDT) July 29, 2020   This workshop is designed to provide the student with a foundational background and understanding of the emerging technology called Blockchain and Cryptocurrencies and further to spark interest in the biggest technology since the internet   Introduction to Blockchain Networks - 11 am (PDT) Aug. 12, 2020   This module provides learners with information on various types of Blockchain Networks including public, private, consortium and permissioned networks. What Blockchain networks are used for, the value they bring to business and society and how networks differ from each other.   Introduction to Blockchain Platforms - 11 am (PDT) Aug. 19, 2020   This two hour workshop provides learners with an introduction to the specific information related to Blockchain platforms including Hyper Ledger, Bitcoin and Ethereum.   Cryptocurrencies and the Digital Economy - 11 am (PDT) Aug. 26, 2020   This module is designed to provide you with a foundational background and understanding Cryptocurrencies, and the Digital Economy.   The Future of Blockchain: Challenges and Opportunities - 11 am (PDT) Sept. 2, 2020   This module is designed to provide you with a foundational background and understanding of the future of the emerging technology called Blockchain.   Learn more                                                                     ","Link":"https://www.eventbrite.ca/e/cryptocurrencies-and-the-digital-economy-tickets-114198785642?aff=ebdssbonlinesearch"},{"Title":"Corda Developer Bootcamp: Americas","Date":"Do., 6. Aug. 2020 20:00 CEST","Price":"Kostenlos","Information":"                        Learn how to build a distributed, blockchain application in one hour! Join us online to learn everything you need to know about blockchain programming, and build your first blockchain application on the Corda blockchain platform.   Led by the R3 Developer Relations team, this is the best way to kick off your journey to become a professional blockchain developer. This free two and half-hour crash course is for aspiring Corda developers or just developers who want to learn about the Corda blockchain platform.   This is a code first course. We assume you’re familiar with Java and blockchain concepts. Otherwise, we provide everything you need to build your own CorDapp and kickstart your Corda journey.   Agenda:   Running a CorDapp   States   Transactions and contracts   Flows   Putting it all together by running a CorDapp      Learn more about our Corda here or join our community on slack.   Learn more about Corda: www.corda.net         Thu, August 6, 2020   8:00 PM – 9:00 PM CEST   Add to Calendar   Online Event   Organizer of Corda Developer Bootcamp: Americas   R3 is an enterprise blockchain software firm working with a broad ecosystem of more than 300 participants across multiple industries from both the private and public sectors to develop on Corda, its open-source blockchain platform, and Corda Enterprise, a commercial version of Corda for enterprise usage.    Today, Corda is backed by R3 and supported by a vibrant community of organizations and developers. Corda Enterprise, the commercial distribution of Corda harnesses the core elements of Corda open source and fine tunes them to meet the service and network infrastructure requirements of today's highly regulated industries.    Learn more about R3 and Corda at r3.com and corda.net.    Or join the conversation on the cordaledger slack channel at slack.corda.net.                               ","Link":"https://www.eventbrite.com/e/corda-developer-bootcamp-americas-tickets-114918113170?aff=ebdssbonlinesearch"},{"Title":"Corda Developer Bootcamp: APAC","Date":"Do., 6. Aug. 2020 10:30 CEST","Price":"Kostenlos","Information":"                        Learn how to build a distributed, blockchain application in on hour! Join us online to learn everything you need to know about blockchain programming, and build your first blockchain application on the Corda blockchain platform.   Led by the R3 Developer Relations team, this is the best way to kick off your journey to become a professional blockchain developer. This free two and half-hour crash course is for aspiring Corda developers or just developers who want to learn about the Corda blockchain platform.   This is a code first course. We assume you’re familiar with Java and blockchain concepts. Otherwise, we provide everything you need to build your own CorDapp and kickstart your Corda journey.   Agenda:   Running a CorDapp   States   Transactions and contracts   Flows   Putting it all together by running a CorDapp      Learn more about our Corda here or join our community on slack.   Learn more about Corda: www.corda.net         Thu, August 6, 2020   10:30 AM – 11:30 AM CEST   Add to Calendar   Online Event   Organizer of Corda Developer Bootcamp: APAC   R3 is an enterprise blockchain software firm working with a broad ecosystem of more than 300 participants across multiple industries from both the private and public sectors to develop on Corda, its open-source blockchain platform, and Corda Enterprise, a commercial version of Corda for enterprise usage.    Today, Corda is backed by R3 and supported by a vibrant community of organizations and developers. Corda Enterprise, the commercial distribution of Corda harnesses the core elements of Corda open source and fine tunes them to meet the service and network infrastructure requirements of today's highly regulated industries.    Learn more about R3 and Corda at r3.com and corda.net.    Or join the conversation on the cordaledger slack channel at slack.corda.net.                               ","Link":"https://www.eventbrite.com/e/corda-developer-bootcamp-apac-tickets-114920811240?aff=ebdssbonlinesearch"},{"Title":"Fighting Plastic & Creating Digital Infrastructure for Circular Economy","Date":"Di., 11. Aug. 2020 17:00 CEST","Price":"Kostenlos","Information":"                        Wilhelm Myrer, founder and CEO of Empower and Chairman of the Oslo Blockchain Cluster will speak on:   Empower, the clean tech company that uses blockchain to build a global plastic waste deposit system.   How they went from a decentralised banking startup to turning that into a company dedicated to fight plastic waste in Empower, providing digital infrastructure for the circular economy.   How (and why) they started the leading blockchain community in Oslo   Wilhelm Myrer, CEO Empower & Chairman of the Oslo Blockchain Cluster, Norway is a serial entrepreneur with 15 years experience in starting and building technology and energy ventures. He is currently the Founder & CEO of the clean-tech company Empower based in Oslo, building a global plastic waste deposit system powered by blockchain technology and the Chairman of the Oslo Blockchain Cluster.   This Tech for Sustainability series is sponsored by Tracr.   Tracr is a Connected Value Chain Platform, fostering a culture of innovation, encouraging sustainable business practices and ensuring consumer trust in the diamond industry. Demonstrating provenance, traceability and authenticity of natural diamonds and helping local economies where they are mined   To find out more, visit community.tracr.com         Tue, August 11, 2020   5:00 PM – 6:00 PM CEST   Add to Calendar   Online Event   Organizer of Fighting Plastic & Creating Digital Infrastructure for Circular Economy   The UK's no.1 Rated Tech Networking Events, in Crypto, Blockchain, AI, Sustainability and Payments. Over Curry and virtual.   © 2020 Eventbrite   \n                    Your email will only be seen by the event organizer. View privacy policy.\n                   Outlook Calendar   Google Calendar   Apple Calendar   Yahoo Calendar   You will be notified by email one hour before the onsale. Reminders can be managed from the event listing.      ","Link":"https://www.eventbrite.co.uk/e/fighting-plastic-creating-digital-infrastructure-for-circular-economy-tickets-113616989474?aff=ebdssbonlinesearch"},{"Title":"Rise Presents: 'Taking blockchain pilot ideas to implementation'","Date":"Do., 3. Sep. 2020 13:00 CEST","Price":"Kostenlos","Information":"                        Our esteemed panelist for the session:   1) Sanachit Mehra - Founder/CEO at Cateina Technologies   An Engineering grad from IIT Roorkee, Sanachit has at various times been an Assistant Professor, an enterprise developer and most recently, an entrepreneur. As the founder Of Cateina Technologies - one of India’s earliest Blockchain adopters - he works with legacy businesses to achieve trustless execution of cross-organizational contracts through secure, shared networks.   He has authored research papers on Quantitative models for earnings management by Indian corporations and built predictive models for addressing supply chain inefficiencies and directional strategies for derivatives trading for fun (and the occasional profit).   Keep your eyes peeled here for other panelists.      #HomeofFinTech #RiseMumbai #Blockchain #Virtualsession         Thu, September 3, 2020   1:00 PM – 2:00 PM CEST   Add to Calendar   Online Event   Organizer of Rise Presents: 'Taking blockchain pilot ideas to implementation'   Breakthrough Coach, Corporate Trainer, Mentor, Author, Change Strategist, Relationship Expert, Inspiring Speaker. 15 years of experience in various sectors globally, touching 8000 lives and winning numerous awards.    © 2020 Eventbrite   \n                    Your email will only be seen by the event organizer. View privacy policy.\n                   Outlook Calendar   Google Calendar   Apple Calendar   Yahoo Calendar   You will be notified by email one hour before the onsale. Reminders can be managed from the event listing.   Events are social. Allow Facebook friends to see your upcoming events?   ","Link":"https://www.eventbrite.com/e/rise-presents-taking-blockchain-pilot-ideas-to-implementation-tickets-113464144310?aff=ebdssbonlinesearch"},{"Title":"Wealth Creation Strategies through Blockchain & Cryptocurrencies","Date":"Fr., 31. Juli 2020 19:00 CEST + 8 weitere Events","Price":"Kostenlos","Information":"                        As money continues evolving, cryptocurrencies have emerged into an asset class in what is the new frontier digital assets, Bitcoin for example has been referred to as \"digital gold\" even by the popular CNN business anchor Richard Quest.Renowned figures that have invested millions of US Dollars in the Bitcoin ecosystem include Microsoft's Bill Gates & Virgin Group's Sir Richard Branson.   BLOCKCHAIN, the technology that underpins Bitcoin, is an open, distributed and public ledger that acts as a permanent record for all transactions between two parties. Most compare this technology with Internet, the technology that was invented to power email in the early 1980’s. Blockchain has been fronted as a key driver of the 4th industrial revolution, alongside Artificial Intelligence (AI).Here in Kenya the Blockchain and Artificial Intelligence Task force recently concluded their report in which they recommended that cryptocurrencies be adopted in the country for financial inclusion of allThe full report can be viewed here: http://www.ict.go.ke/blockchain.pdf   Christine Lagarde, the president of the European Central Bank and immediate head of the International Monetary Fund (IMF) early this year warned of a looming financial crisis reminiscent of the 2008-09 financial crisis that caused a global economic meltdown. The question is how well are you prepared? Many analysts have agreed that Bitcoin and cryptocurrencies will be the perfect hedging over the recession.   What You Will Learn:• What is Bitcoin and how does it work?   • What is Blockchain?   • How can you invest in Bitcoin & other alternative Cryptocurrencies?   • How can you accumulate digital currencies and increase your wealth portfolio?   • How can you benefit from Bitcoin and make profits?   RSVP: ALEX RUTHI - 0724639388         Online Event   Organizer of Wealth Creation Strategies through Blockchain & Cryptocurrencies   Cryptocurrency Educator & Entrepreneur   Bitcoin Miner with Mining City https://miningcity.com, a VIP partner of BTC.com https://btc.com/, https://pool.btc.com/ the biggest mining company in the world. Check it out also on blockchain https://www.blockchain.com/   © 2020 Eventbrite   \n                    Your email will only be seen by the event organizer. View privacy policy.\n                   Outlook Calendar   Google Calendar   Apple Calendar   Yahoo Calendar   You will be notified by email one hour before the onsale. Reminders can be managed from the event listing.   Events are social. Allow Facebook friends to see your upcoming events?   ","Link":"https://www.eventbrite.com/e/wealth-creation-strategies-through-blockchain-cryptocurrencies-tickets-113882589892?aff=ebdssbonlinesearch"},{"Title":"Building a Blockchain-Based Health Passport During COVID-19 with Orbs","Date":"Do., 6. Aug. 2020 15:15 CEST","Price":"Kostenlos","Information":"                        Ran Melamed, Head of Business Development, Orbs:   Ran is Head of Business Development at Orbs, based in Singapore and leading the company’s global business operations. He has a strong background in finance, business development and establishing partnerships with both local and global brands for over 15 years in the Israeli High-Tech Industry. He is the Founder & former CEO of Tingz.me, a technology startup. Ran is also experienced in M&A and Venture Capital and was an investment team member at Viola Growth capital fund.   Ran holds a BSc in Physics and an MA in Economics from Tel Aviv University and is a veteran of an elite section of the IDF 8200 unit.   ​The Global Blockchain Business Council (GBBC) is the leading industry association for the blockchain technology ecosystem. Conceived on Sir Richard Branson’s Necker Island, the GBBC is a Swiss-based non-profit launched in 2017 in Davos, Switzerland. The organization brings together innovators and thought-leaders from over 50 countries to further adoption of blockchain technology by engaging and educating regulators, business leaders, and lawmakers on how to harness this groundbreaking technology to create more secure, equitable, and functional societies.         Thu, August 6, 2020   3:15 PM – 4:00 PM CEST   Add to Calendar   Online Event   Organizer of Building a Blockchain-Based Health Passport During COVID-19 with Orbs   © 2020 Eventbrite   \n                    Your email will only be seen by the event organizer. View privacy policy.\n                   Outlook Calendar   Google Calendar   Apple Calendar   Yahoo Calendar   You will be notified by email one hour before the onsale. Reminders can be managed from the event listing.   Events are social. Allow Facebook friends to see your upcoming events?   Please help Eventbrite investigate this event by providing information about why you're reporting it.","Link":"https://www.eventbrite.com/e/building-a-blockchain-based-health-passport-during-covid-19-with-orbs-tickets-113516368514?aff=ebdssbonlinesearch"},{"Title":"Mining Disrupt Live | Bitcoin Blockchain Mining Conference","Date":"Mi., 20. Jan. 2021 15:00 CET","Price":"Ab 50,00 $","Information":"                        Eventbrite's fee is nonrefundable.         Wed, Jan 20, 2021, 3:00 PM CET      Add to Calendar   Online Event   Contact the organizer to request a refund.   Eventbrite's fee is nonrefundable.   Organizer of Mining Disrupt Live | Bitcoin Blockchain Mining Conference   © 2020 Eventbrite   \n                    Your email will only be seen by the event organizer. View privacy policy.\n                   Outlook Calendar   Google Calendar   Apple Calendar   Yahoo Calendar   You will be notified by email one hour before the onsale. Reminders can be managed from the event listing.   Events are social. Allow Facebook friends to see your upcoming events?   Please help Eventbrite investigate this event by providing information about why you're reporting it.","Link":"https://www.eventbrite.com/e/mining-disrupt-live-bitcoin-blockchain-mining-conference-tickets-114668727250?aff=ebdssbonlinesearch"},{"Title":"Vision of decentralized future in VR","Date":"Di., 4. Aug. 2020 17:00 CEST","Price":"Kostenlos","Information":"                              Tue, August 4, 2020   5:00 PM – 6:30 PM CEST   Add to Calendar   Online Event   Organizer of Vision of decentralized future in VR   Sensorium Corporation was founded with the purpose to implement a project that forms the social environment of the future based on the synthesis of modern practices of various industries (gaming industry, show business, cinema and social networks), embodied in an innovative product — Sensorium Galaxy. Modern VR, AI and streaming capabilities have formed the basis for the next stage of social media evolution – Social VR. Sensorium aims to bridge the quintessence of new technologies with community of users to form the social environment of the future. Sensorium Galaxy is a set of star systems, content hubs, which expand the directions of human thought and activity.   .           © 2020 Eventbrite   \n                    Your email will only be seen by the event organizer. View privacy policy.\n                   Outlook Calendar   Google Calendar   Apple Calendar   Yahoo Calendar   You will be notified by email one hour before the onsale. Reminders can be managed from the event listing.   Events are social. Allow Facebook friends to see your upcoming events?   Please help Eventbrite investigate this event by providing information about why you're reporting it.","Link":"https://www.eventbrite.com/e/vision-of-decentralized-future-in-vr-tickets-115388691683?aff=ebdssbonlinesearch"},{"Title":"State of Blockchain Investor Panel + Startup Pitches (On Zoom)","Date":"Mi., 12. Aug. 2020 21:00 CEST","Information":"","Link":""},{"Title":"FUTURE OF BITCOIN CYCLES [on ZOOM]- SOCIAL TRADING - 50%-100% p.a. target","Date":"Do., 6. Aug. 2020 14:00 CEST","Price":"Kostenlos","Information":"                        This is a Zoom webinar for FUTURE OF BITCOIN CYCLES. Reception at 7:45pm, starts at 8:00pm sharp for KL time or 7:00pm Jakarta time. 2 hours of power-packed content.   Zoom Link : https://zoom.us/j/4111346112 (password will be posted here on that day. Please return here for the password on that day)   In this event, I will give a Free Insightful Educational and bitcoin public awareness Talk on Bitcoin, Bitcoin Price Cycle analysis and Blockchain Basics. This will be followed by free preview of my simple trading experience using SOCIAL TRADING with Etoro. This exclusive and educational talk on Bitcoin, Bitcoin Cycle Analysis and Blockchain basics will give you a better indepth understanding of why Bitcoin has been disruptive but impactful and beneficial since their inception in 2009.   I will also sincerely present my personal testiment where I converted ard USD5000 to USD123,000+ of bitcoin within 4 years. The slide for this portion of the presentation is one of the images I have uploaded as seen below.      ------------   AGENDA   ------------   The summary content of this powerful 2 hours talk covers the following...   7:45 Reception   Introduction   Bitcoin Basics : Why is Bitcoin Blockchain Disruptive?   Bitcoin Adoption : Demand Increasing   Blockchain Basics   Bitcoin Halving : Supply Decreasing   Price Prediction and Bitcoin Market cycle   . . . . . . .   SOCIAL TRADING with Etoro   BITCOIN CYCLE ANALYSIS Workshop Preview   Q&A      ---------------------------------------------   PROJECTION Profitability Targets                                                                                                      ","Link":"https://www.eventbrite.com/e/future-of-bitcoin-cycles-on-zoom-social-trading-50-100-pa-target-tickets-113334626920?aff=ebdssbonlinesearch"},{"Title":"IOTA Course for Developers // Learning App Only (pure digital, no  support)","Date":"Do., 30. Juli 2020 09:00 CEST + 62 weitere Events","Price":"Ab 299,50 €","Information":"                           - This course let you explore all the IT libraries and resources as well as developer tools that you need to start sending and receiving transactions.      - This course also gives you all knowledge that you need to set-up a professional development environment and automated tests, debugging, deployment, etc.      You will learn how to code with the MAM library and send and receive data streams.      You will also learn the main concepts and features of Qubic.      You can develop your own fully functional IOTA Application on your own request. The content in the app helps you to do so.         Requirements      You would need to have an engineering or computer science background or be at least a highly motivated autodidact   Basic understanding of Blockchain & PGP or Cryptography      Developer Skills: you'd need to have good JavaScript skills (JS)      What’s in for the price?      Get basic programming knowledge of IOTA   Get a hands-on course with a very practical approach and a TDD (Test Driven Development).                                                                                                         ","Link":"https://www.eventbrite.de/e/iota-course-for-developers-learning-app-only-pure-digital-no-support-tickets-85514858243?aff=ebdssbonlinesearch"},{"Title":"Episode 005 Enterprise DLT Live - Adam Krellenstein, Symbiont","Date":"Do., 30. Juli 2020 21:00 CEST","Price":"Ab 10,00 $","Information":"                        Eventbrite's fee is nonrefundable.   Enterprise DLT Live is a live-streamed, live-audience interview series featuring global enterprise leaders (people building real world blockchain and Distributed Ledger Technology (DLT) systems) discussing their hard-won wisdom regarding systems design, governance, mechanism design, key management, stakeholder communications, project management, and more! The series highlights lessons learned, emerging good practices, and “knacks” (things you can’t get from a book) from real-world practitioners, for real-world practitioners.   Enterprise DLT Live is tailored for enterprise blockchain and DLT practitioners - people who are delivering value to enterprise customers (internal or external) via a DLT project. Your fellow audience members are hungry to learn from the real world experiences of others, and enjoy opportunities to engage with each other as well as with our guests. Participate in the 60-minute livestreamed interview, plus stick around for 30 minutes of unrecorded, unstreamed Q&A exclusively for webinar attendees.   Prefer a more passive, free experience? Unable to make the live event? Watch the 60-minute livestream (live or recorded) on YouTube.   A prior interview subject, GrainChain (Episode 003), is built on Symbiont. We love GrainChain. Therefore we here at Enterprise DLT Live are predisposed to feel nice things toward Symbiont.   Symbiont is the enterprise fintech company creating the next generation of financial markets infrastructure using blockchain technology. Assembly™, Symbiont’s enterprise blockchain platform, creates efficiencies, eliminates manual data replication and reconciliation processes, and enables real-time data sharing with complete privacy.   The world’s leading financial services firms, including Citi, Nasdaq, Ranieri, Templum and Vanguard, choose to work with Symbiont to solve their toughest business problems. With offices in New York and Amsterdam, Symbiont is led by a team of experts in capital markets and blockchain technology. Learn more about Symbiont at https://symbiont.io or contact the team at info@symbiont.io.   Adam Krellenstein is the CTO and co-founder of Symbiont.io, the market-leading smart contracts platform for institutional applications of blockchain technology. Adam is also one of the creators of Counterparty, an open-source protocol for decentralized finance on the Bitcoin blockchain.   Thomas B. Cox has a passion for the design of effective systems, processes, and governance.   After a 15 year career in database architecture, plus 10 years of organizational, management, and cultural change consulting, Thomas entered the DLT industry where he made a name as an expert on blockchain governance. Thomas’s passion for his discipline is demonstrated in his extensive writings, lectures, and work on standards.   Thomas serves as Chief Governance Officer of StrongBlock, a Blockchain-as-a-Service platform and consultancy. He chairs IEEE’s P2145 “Blockchain/DLT Governance Standards” Working Group, and is the lead host of Enterprise DLT Live.   With StrongBlock's revolutionary blockchain platform, you can go from account registration to a running blockchain in minutes. StrongBlock's Marketplace brings together the best DApps & Services from our Partners to help you build blockchain solutions you need.         Thu, July 30, 2020   9:00 PM – 10:30 PM CEST   Add to Calendar   Online Event   Contact the organizer to request a refund.   Eventbrite's fee is nonrefundable.   Organizer of Episode 005 Enterprise DLT Live - Adam Krellenstein, Symbiont   © 2020 Eventbrite   \n                    Your email will only be seen by the event organizer. View privacy policy.\n                                     ","Link":"https://www.eventbrite.com/e/episode-005-enterprise-dlt-live-adam-krellenstein-symbiont-tickets-114350830412?aff=ebdssbonlinesearch"},{"Title":"Blockchain para Empresa - Especialização Online em Blockchain","Date":"Mo., 27. Juli 2020 11:00 CEST","Price":"Ab 925,92 R$","Information":"                        ABERTURA DAS AULAS 27 DE JULHO   77 horas de conteúdo on line, mais   36 horas de interação ao vivo, on line, com instrutores, alunos e convidados   O Blockchain se posiciona na transformação de toda a indústria e das funções administrativas - redefinindo a maneira como transacionamos online, compartilhamos ideias e gerenciamos fluxos de trabalhos. É a nova tecnologia que todos os profissionais de negócios precisam entender.   Esta especialização te introduz ao mundo da tecnologia Blockchain - explicando o que é, como funciona e porque é revolucionária. Você aprenderá diversas categorias de criptoativos e as formas que podem ser transacionados. Aprenderá como a blockchain revoluciona os modelos de negócios e serviços financeiros, oferecendo novas escolhas em como as organizações podem criar e gerenciar valor.   A especialização é ministrada por Don Tapscott e Alex Tapscott, autoridades reconhecidas internacionalmente na inovação e tecnologia e autores do Best-seller Blockchain Revolution. Também inclui vários especialistas do mercado e desenvolvedores da fundação Ethereum, Grid Singularity, Keyless Technologies, e ResonanceX que compartilham suas experiências com o ecossistema blockchain.   Adicionalmente, você ganhará acesso as pesquisas inovadoras do Blockchain Research Institute assim como a Blockchain Case Commons— uma coleção colaborativa de aplicações e casos de uso da blockchain aplicada em diversos setores.   Ao completar esta especialização, você terá produzido uma análise de oportunidade em Blockchain, tendo identificado e avaliado uma promissora aplicação da tecnologia blockchain em seu próprio setor.      Nesse primeiro curso de especialização, discutiremos as limitações da internet para os negócios e atividades econômicas, e explicaremos como a tecnologia blockchain representa o caminho para evoluir. Depois de completar esse curso, você será capaz de explicar como a blockchain é, como funciona, e porque é revolucionária. Você irá aprender os conceitos chave tais como mineração, hashing, proof-of-work, chave criptográfica pública e o problema de duplo gasto. Você será capaz de descrever os 7 princípios para a tecnologia blockchain e os desafios enfrentados para que as pessoas desenvolvam essa tecnologia. Você também conhecerá os principais personagens no ecossistema blockchain, e considerará por si próprio a função que desempenhará na revolução blockchain.   Atualmente, grandes intermediários estabelecem confiança em nossa economia e controlam a movimentação, armazenamento e alocação de dinheiro e ativos. O status quo, entretanto, é repleto de ineficiências. Neste curso, endereçaremos diversos desafios no status quo e discutiremos como critptoativos, smart contracts, novos sistemas de identidade e novos modelos de negócios financeiros podem ajudar a superá-los. Você aprenderá como a tecnologia blockchain empondera indivíduos, empreendedores e negócios com as ferramentas que precisam para nivelar sua capacidade e participar do valor que eles geram. No final deste curso, você aprenderá como e por que a transação na blockchain pode nos ajudar a criar um futuro mais rápido, mais justo e mais distribuído do que o mundo em que vivemos hoje.   A Blockchain trará mudanças profundas nos negócios e em sua própria natureza. Essa tecnologia revolucionará o modo como as empresas são financiadas e gerenciadas, como criam valor e até como desempenham funções básicas, como marketing e contabilidade. Neste curso, você aprenderá como a tecnologia blockchain penetrará nas estruturas das organizações. Você explorará como a blockchain transformará os papéis do C-Suite e como a blockchain pode ser usada para gerenciar e proteger a propriedade intelectual. Você será capaz de identificar as diferentes camadas da pilha da tecnologia blockchain e explicar como isso afeta a governança dos sistemas blockchain. Além disso, você será capaz de identificar sete qualidades que uma região do mundo precisa para atrair startups de tecnologia e construir um ecossistema vibrante de blockchain.   Neste quarto e último curso da especialização, você sintetizará seu aprendizado em uma entrega do projeto chamada Análise de Oportunidade Blockchain. Os objetivos deste curso são duplos: primeiro, é para você identificar uma necessidade ou problema específico no setor escolhido que pode ser potencialmente resolvido usando a tecnologia blockchain. Segundo, cabe a você investigar possíveis soluções para esse problema, incluindo como essas soluções podem ser executadas. Você alcançará marcos de projeto diferentes a cada semana e será apresentado a várias ferramentas que os empreendedores usam para organizar suas descobertas. Durante todo esse processo, você ouvirá profissionais do mundo real que têm experiência prática no ecossistema blockchain. Além disso, ao participar deste curso, você terá acesso ao nosso Blockchain Case Commons - uma coleção de aplicativos e casos de uso de blockchain em vários setores. Como resultado deste curso, você terá uma Análise de Oportunidade Blockchain consolidada e revisada por pares, que poderá usar para apresentar sua ideia à sua organização ou mesmo a potenciais investidores.      Todas as terças feiras das 20:00 Às 21:30, os participantes são convidados a participar pelo Zoom de encontros com os instrutores do curso e convidados para apresentação de conteúdos exclusivos como:   Os encontros discutirão também temas e casos de uso propostos pelos participantes para interação e análise com o grupo.   No possibilidade de levantamento das restrições de isolamento, encontros presenciais podem ser organizados a pedido dos participantes com presença de instrutores do BRI Brasil.         Seg, 27 de Jul de 2020, 11:00 –   Sáb, 1 de Ago de 2020, 14:00 CEST   Adicionar ao calendário   Evento online                                                                                             ","Link":"https://www.eventbrite.com.br/e/blockchain-para-empresa-especializacao-online-em-blockchain-tickets-110077021334?aff=ebdssbonlinesearch"},{"Title":"FUTURE OF BITCOIN CYCLES [on ZOOM]- SOCIAL TRADING - 50%-100% p.a. target","Date":"Do., 27. Aug. 2020 14:00 CEST","Price":"Kostenlos","Information":"                        This is a Zoom webinar for FUTURE OF BITCOIN CYCLES. Reception at 7:45pm, starts at 8:00pm sharp for KL time or 7:00pm Jakarta time. 2 hours of power-packed content.   Zoom Link : https://zoom.us/j/4111346112   Zoom Room ID : 4111346112   Password : FOBC   In this event, I will give a Free Insightful Educational and bitcoin public awareness Talk on Bitcoin, Bitcoin Price Cycle analysis and Blockchain Basics. This will be followed by free preview of my simple trading experience using SOCIAL TRADING with Etoro. This exclusive and educational talk on Bitcoin, Bitcoin Cycle Analysis and Blockchain basics will give you a better indepth understanding of why Bitcoin has been disruptive but impactful and beneficial since their inception in 2009.   I will also sincerely present my personal testiment where I converted ard USD5000 to USD123,000+ of bitcoin within 4 years. The slide for this portion of the presentation is one of the images I have uploaded as seen below.      ------------   AGENDA   ------------   The summary content of this powerful 2 hours talk covers the following...   7:45 Reception   Introduction   Bitcoin Basics : Why is Bitcoin Blockchain Disruptive?   Bitcoin Adoption : Demand Increasing   Blockchain Basics   Bitcoin Halving : Supply Decreasing   Price Prediction and Bitcoin Market cycle   . . . . . . .   SOCIAL TRADING with Etoro   BITCOIN CYCLE ANALYSIS Workshop Preview   Q&A                                                                                                               ","Link":"https://www.eventbrite.com/e/future-of-bitcoin-cycles-on-zoom-social-trading-50-100-pa-target-tickets-115331234828?aff=ebdssbonlinesearch"},{"Title":"CipherTrace Certified Examiner Training (North America)","Date":"Do., 30. Juli 2020 16:00 CEST","Price":"Ab 1.000,00 $","Information":"                        Eventbrite's fee is nonrefundable.   Participants will develop and hone digital investigation techniques as they learn a risk-based approach to tracing the source of blockchain funds and de-anonymizing cryptocurrency transactions with cryptocurrency forensic tools. The course will equip participants with an understanding of cryptocurrency fundamentals and the specific understanding of tracing transactions. They will learn to improve the efficiency and effectiveness of blockchain investigations by learning how to best leverage tools and resources to reduce investigation time and improve information yield. Upon successfully completing the course and passing the exam, you will be accredited as a CipherTrace Certified Examiner (CTCE).      Led by Pamela Clegg, a leading expert in cryptocurrency forensics with over 10 years of experience with investigations, due diligence and intelligence operations, this cryptocurrency financial investigation training provides hands-on instruction in the use of this industry-leading platform. After the completion of training, participants will be able to:      Participating in this training will improve the efficiency and effectiveness of participant’s blockchain forensic investigations. Participants will learn ways to best leverage CipherTrace tools and resources to reduce investigation time and improve information yield.   The CTCE credential provides assurance to current and potential employers of an individual’s knowledge and experience with blockchain investigations and analytics.   This CTCE credential increases one’s standing in the cryptocurrency and AML community by verifying the integrity of one’s knowledge and skills and the reliability with which they can be applied.   The CTCE accreditation provides validation of forensic skills and real-world application of those skills in interpreting the data found within the CipherTrace cryptocurrency investigation toolset and threat intelligence database. Participants will learn how to produce reports that can be used by law enforcement. Along with other blockchain and cryptocurrency certification it provides credibility in legal proceedings, law enforcement investigations, and regulatory enforcement processes.   This event program has been approved by the Association of Certified Financial Crime Specialists (ACFCS) for 7 CFCS credits. ACFCS is a global member organization that provides training, tools and certification to enable professionals to combat all forms of financial crime. Visit www.acfcs.org to learn more.            Thu, Jul 30, 2020, 4:00 PM –   Fri, Jul 31, 2020, 12:00 AM CEST   Add to Calendar   Online Event   Contact the organizer to request a refund.   Eventbrite's fee is nonrefundable.   Organizer of CipherTrace Certified Examiner Training (North America)   © 2020 Eventbrite   \n                    Your email will only be seen by the event organizer. View privacy policy.\n                   Outlook Calendar                  ","Link":"https://www.eventbrite.com/e/ciphertrace-certified-examiner-training-north-america-registration-110164332484?aff=ebdssbonlinesearch"},{"Title":"CipherTrace Certified Examiner Training (North America)","Date":"Do., 20. Aug. 2020 16:00 CEST","Price":"Ab 1.000,00 $","Information":"                        Eventbrite's fee is nonrefundable.   Participants will develop and hone digital investigation techniques as they learn a risk-based approach to tracing the source of blockchain funds and de-anonymizing cryptocurrency transactions with cryptocurrency forensic tools. The course will equip participants with an understanding of cryptocurrency fundamentals and the specific understanding of tracing transactions. They will learn to improve the efficiency and effectiveness of blockchain investigations by learning how to best leverage tools and resources to reduce investigation time and improve information yield. Upon successfully completing the course and passing the exam, you will be accredited as a CipherTrace Certified Examiner (CTCE).      Led by Pamela Clegg, a leading expert in cryptocurrency forensics with over 10 years of experience with investigations, due diligence and intelligence operations, this cryptocurrency financial investigation training provides hands-on instruction in the use of this industry-leading platform. After the completion of training, participants will be able to:      Participating in this training will improve the efficiency and effectiveness of participant’s blockchain forensic investigations. Participants will learn ways to best leverage CipherTrace tools and resources to reduce investigation time and improve information yield.   The CTCE credential provides assurance to current and potential employers of an individual’s knowledge and experience with blockchain investigations and analytics.   This CTCE credential increases one’s standing in the cryptocurrency and AML community by verifying the integrity of one’s knowledge and skills and the reliability with which they can be applied.   The CTCE accreditation provides validation of forensic skills and real-world application of those skills in interpreting the data found within the CipherTrace cryptocurrency investigation toolset and threat intelligence database. Participants will learn how to produce reports that can be used by law enforcement. Along with other blockchain and cryptocurrency certification it provides credibility in legal proceedings, law enforcement investigations, and regulatory enforcement processes.   This event program has been approved by the Association of Certified Financial Crime Specialists (ACFCS) for 7 CFCS credits. ACFCS is a global member organization that provides training, tools and certification to enable professionals to combat all forms of financial crime. Visit www.acfcs.org to learn more.            Thu, Aug 20, 2020, 4:00 PM –   Fri, Aug 21, 2020, 12:00 AM CEST   Add to Calendar   Online Event   Contact the organizer to request a refund.   Eventbrite's fee is nonrefundable.   Organizer of CipherTrace Certified Examiner Training (North America)   © 2020 Eventbrite   \n                    Your email will only be seen by the event organizer. View privacy policy.\n                   Outlook Calendar                  ","Link":"https://www.eventbrite.com/e/ciphertrace-certified-examiner-training-north-america-registration-110164488952?aff=ebdssbonlinesearch"},{"Title":"Blockchain DLT - Shardus 2020 Q2 Virtual Event","Date":"Sa., 1. Aug. 2020 20:00 CEST","Price":"Kostenlos","Information":"                           Who is attending:      Agenda:   Saturday Aug 1st, 2020   1:00 pm - 2:00 pm Shardus Presentation and Demonstration   Location:   Victual Event - https://shardus.com/live   For press or inquiries contact info@shardus.com   https://shardus.com/live         Sat, August 1, 2020   8:00 PM – 9:00 PM CEST   Add to Calendar   Online Event   Organizer of Blockchain DLT - Shardus 2020 Q2 Virtual Event   Shardus is building distributed ledger software to remedy the problems of traditional blockchains -- scalability, decentralization and efficiency. The technology being developed will use compute and state sharding to accommodate billions of daily active users, allowing for global-scale decentralized applications.   \n   © 2020 Eventbrite   \n                    Your email will only be seen by the event organizer. View privacy policy.\n                   Outlook Calendar   Google Calendar               ","Link":"https://www.eventbrite.com/e/blockchain-dlt-shardus-2020-q2-virtual-event-tickets-114367757040?aff=ebdssbonlinesearch"},{"Title":"5G and IOT Revolution: what's the role of blockchain? | WEBINAR","Date":"Mi., 2. Sep. 2020 19:00 CEST","Price":"Kostenlos","Information":"                        As usual, a panel of five to six stakeholders from the tech and business space will debate the topic during a panel discussion that looks very promising.   Program   About Trustless Ecosystems 2030   Created back in 2018, the Trustless Ecosystems 2030 group counts today over one thousand members across platforms, it is well known for organizing meaningful discussions focused on blockchain and emerging technologies. Speakers are stake-holders from companies of any size implementing blockchain, start-up founders, CTOs and advisors actively involved in this space. Founding purpose of the group is to facilitate collaboration between decision-makers and the blockchain world.   FOLLOW US      Sponsorship   The event is supported by TIIQU and takes place on Zoom.   Link to the webinar   Participants receive the link after sign up      Speaking opportunities   If you are actively involved in a blockchain/ AI -based project and you want to contribute to this or other panel discussions, please fill this form         Wed, September 2, 2020   7:00 PM – 8:45 PM CEST   Add to Calendar   Online Event   Organizer of 5G and IOT Revolution: what's the role of blockchain? | WEBINAR   © 2020 Eventbrite   \n                    Your email will only be seen by the event organizer. View privacy policy.\n                   Outlook Calendar                  ","Link":"https://www.eventbrite.co.uk/e/5g-and-iot-revolution-whats-the-role-of-blockchain-webinar-tickets-107418983070?aff=ebdssbonlinesearch"},{"Title":"BitAngels Los Angeles Virtual Event (August 2020)","Date":"Mi., 12. Aug. 2020 19:00 CEST","Information":"","Link":""},{"Title":"G-Tank Live Pitch Competition","Date":"Fr., 7. Aug. 2020 21:00 CEST","Price":"Ab 500,00 $","Information":"                        Eventbrite's fee is nonrefundable.   Pitch your Blockchain or Crypto-related startup to an esteemed panel of judges like Francis Konig, and more. This is your chance to tell the world all the great things your company is doing.         Fri, Aug 7, 2020, 9:00 PM –   Sat, Aug 8, 2020, 12:30 AM CEST   Add to Calendar   Online Event   Contact the organizer to request a refund.   Eventbrite's fee is nonrefundable.   Organizer of G-Tank Live Pitch Competition   © 2020 Eventbrite   \n                    Your email will only be seen by the event organizer. View privacy policy.\n                   Outlook Calendar   Google Calendar   Apple Calendar   Yahoo Calendar   You will be notified by email one hour before the onsale. Reminders can be managed from the event listing.   Events are social. Allow Facebook friends to see your upcoming events?   Please help Eventbrite investigate this event by providing information about why you're reporting it.","Link":"https://www.eventbrite.com/e/g-tank-live-pitch-competition-tickets-112043372744?aff=ebdssbonlinesearch"},{"Title":"Supply Chain Innovation","Date":"Do., 13. Aug. 2020 15:00 CEST","Price":"Kostenlos","Information":"                              Do., 13. August 2020   15:00 – 16:30 CEST   Zum Kalender hinzufügen   Online-Event   Veranstalter von Supply Chain Innovation   © 2020 Eventbrite   \n                    Ihre E-Mail wird nur vom Eventveranstalter gesehen. Datenschutzrichtlinien anzeigen\n                   Outlook-Kalender   Google-Kalender   Apple-Kalender   Yahoo! Kalender   Sie werden eine Stunde vor Start des Vorverkaufs per E-Mail benachrichtigt. Die Erinnerungen können Sie auf der Eventseite verwalten.   Events sind Social Happenings. Möchten Sie, dass Ihre anstehenden Events für Ihre Facebook-Freunde sichtbar sind?   Bei der Prüfung dieses Events sind wir auf Ihre Mithilfe angewiesen. Bitte geben Sie den Grund für Ihre Meldung an.","Link":"https://www.eventbrite.de/e/supply-chain-innovation-tickets-115037746998?aff=ebdssbonlinesearch"},{"Title":"Democracy4all 2020 - Global Online Edition","Date":"Di., 6. Okt. 2020 11:00 CEST","Price":"Kostenlos","Information":"                        In 2020 D4A returns with more than 50 insightful speakers sharing with you their expertise on blockchain for 2 days. On the Day 1 we will be addressing issues of digital rights, data protection, transparent and secure e-voting and near future of digital identity. And during Day 2 we will deep dive into the world of digital assets, STO regulations, digital securities trading and future of central bank digital currencies.   Find out more at d4a.io         Tue, 6 Oct 2020, 11:00 –   Wed, 7 Oct 2020, 17:00 CEST   Add to Calendar   Online Event   Organiser of Democracy4all 2020 - Global Online Edition   Join to Barcelona Blockchain Week!\nBarcelona Blockchain Week is one whole week full of events, meet-ups and networking. It brings together both local and global industry experts as well as providing great opportunityfor general public to learn more about blockchain technology and its use cases. This unique weeklong experience highlights Barcelona on the map as one of the main blockchain and crypto hubs in Europe.       © 2020 Eventbrite   \n                    Your email will only be seen by the event organiser. View privacy policy.\n                   Outlook Calendar   Google Calendar   Apple Calendar   Yahoo Calendar   You will be notified by email one hour before the onsale. Reminders can be managed from the event listing.   Events are social. Allow Facebook friends to see your upcoming events?   Please help Eventbrite investigate this event by providing information about why you're reporting it.","Link":"https://www.eventbrite.co.uk/e/democracy4all-2020-global-online-edition-tickets-107549461334?aff=ebdssbonlinesearch"},{"Title":"Live Instructor Led Distance Learning Blockchain Developer MasterClass","Date":"Do., 30. Juli 2020 10:30 CEST + 33 weitere Events","Price":"Ab 725,00 £","Information":"                        This Blockchain course provides coverage of Bitcoin, Hyperledger, Ethereum, and Multichain blockchain platforms. In this course, you will utilize tools like Ganache, Truffle, Meta Mask, and Geth to build Blockchain applications, learn how to set up a private blockchain network using Hyperledger Composer, and deploy smart contracts on Ethereum.   At the end of this Masters Program, you will be equipped with the following skillset:   Once you enrol for the course you will receive a link giving you access the Learning Management Systems.   You will then be able to review each module in the leaning path and start to plan your study time and book your Live Class room session.   All of the project based session have virtual lab access setup will all software and tools pre installed.   Help is available 24/7 should you require any assistance.   Certification Details and Criteria:   Online Classroom:   Attend one complete batch   Submit at least one completed project   Successful evaluation in any one of the course end assessments with a minimum score of at least 60 percent   Online Self Learning:   Complete 85 percent of the course   Submit at least one completed project   Successful evaluation in any one of the course end assessments with a minimum score of 60 percent   Plan you time and book onto the Live Instructor Led courses when you are ready via your Learning Management Systems Login.   All live Courses, Self Study and Projects are Planned in Sequence to ensure you are taking the course in the correct order and building up your skillset.         Online Event   Organiser of Live Instructor Led Distance Learning Blockchain Developer MasterClass   Why Attend an Acumen Envision Course?   Super Creative                                       ","Link":"https://www.eventbrite.co.uk/e/live-instructor-led-distance-learning-blockchain-developer-masterclass-tickets-102914353602?aff=ebdssbonlinesearch"},{"Title":"Certified Blockchain Consultant™ Course Preview","Date":"Sa., 15. Aug. 2020 09:00 CEST","Information":"","Link":""},{"Title":"Digital Week Online Autumn 2020","Date":"","Price":"Ab 5,00 $","Information":"                        Institutional investments and trading, infrastructure and framework   Exchanges track   Adoption, payments, wallets   Regulations, CBDC, forecasts for 2021   Mining   Time Zone GMT+8   Time Zone GMT+3   Time Zone GMT-7   Innovation Days key tracks:         Online Event   Organiser of Digital Week Online Autumn 2020   © 2020 Eventbrite   \n                    Your email will only be seen by the event organiser. View privacy policy.\n                   Outlook Calendar   Google Calendar   Apple Calendar   Yahoo Calendar   You will be notified by email one hour before the onsale. Reminders can be managed from the event listing.   Events are social. Allow Facebook friends to see your upcoming events?   Please help Eventbrite investigate this event by providing information about why you're reporting it.","Link":"https://www.eventbrite.hk/e/digital-week-online-autumn-2020-tickets-115165216262?aff=ebdssbonlinesearch"},{"Title":"Security Panel & FSG Webinar: The Security and Impact of Blockchain","Date":"Di., 1. Sep. 2020 20:00 CEST","Price":"Kostenlos","Information":"                        Speakers include:   Liveryman Tom Ilube CBE is CEO of Crossword Cybersecurity PLC and a Non Executive Director of the BBC. Previously, Tom was a Managing Director at Callcredit Information Group (now Transunion UK). Prior to Callcredit, Tom founded and was CEO of Garlik, a VC backed ID protection company, sold to Experian in 2011. Earlier, in his career Tom served as Chief Information Officer of Egg Banking plc and worked at Goldman Sachs, PwC and the London Stock Exchange. Tom was founding Chair of Hammersmith Academy and is currently founding Chair of the African Science Academy, the continent's first all girls STEM school.      Court Assistant Gus Machado is the WCIT’s representative on the FSG. He has run IT services businesses for over 30 years and is involved with AI, Machine learning and Big Data projects.      Tickets: Voluntary donation to the WCIT Charity - SC: 18-00-02 / AC: 07427727 / Please use your name as the reference or visit our JustGiving page - https://www.justgiving.com/wcit.      ZOOM details will be provided nearer the date.                     Tue, 1 September 2020   20:00 – 21:30 CEST   Add to Calendar   Online Event   Organiser of Security Panel & FSG Webinar: The Security and Impact of Blockchain   © 2020 Eventbrite   \n                    Your email will only be seen by the event organiser. View privacy policy.\n                   Outlook Calendar   Google Calendar               ","Link":"https://www.eventbrite.co.uk/e/security-panel-fsg-webinar-the-security-and-impact-of-blockchain-tickets-115093726434?aff=ebdssbonlinesearch"},{"Title":"ditact 2020","Date":"Di., 1. Sep. 2020 08:00 CEST","Price":"Kostenlos","Information":"                        Heuer mit vielen Online-Angeboten!   Artificial Intelligence, Machine Learning, Web, HCI, Big Data, Internet of Things, Robotics, Security, Blockchain, internationale Zertifizierungen, das Modul \"Smarte Schule\", kostenfreie Lunch Lectures, Online-Yoga am Morgen und vieles mehr.               Di., 1. Sept. 2020, 08:00 –   Sa., 12. Sept. 2020, 20:00 CEST   Zum Kalender hinzufügen   Online-Event   Veranstalter von ditact 2020   © 2020 Eventbrite   \n                    Ihre E-Mail wird nur vom Eventveranstalter gesehen. Datenschutzrichtlinien anzeigen\n                   Outlook-Kalender   Google-Kalender   Apple-Kalender   Yahoo! Kalender   Sie werden eine Stunde vor Start des Vorverkaufs per E-Mail benachrichtigt. Die Erinnerungen können Sie auf der Eventseite verwalten.   Events sind Social Happenings. Möchten Sie, dass Ihre anstehenden Events für Ihre Facebook-Freunde sichtbar sind?   Bei der Prüfung dieses Events sind wir auf Ihre Mithilfe angewiesen. Bitte geben Sie den Grund für Ihre Meldung an.","Link":"https://www.eventbrite.de/e/ditact-2020-tickets-105695231282?aff=ebdssbonlinesearch"},{"Title":"FREE Webinar:  Wealth Creation Using Gaming and Blockchain Technology","Date":"Fr., 31. Juli 2020 14:00 CEST + 42 weitere Events","Price":"Kostenlos","Information":"                        BT Tycoon is an important project for TRON and BTT to get into community gaming. It will promote BTT circulation, increase market value and consolidate the construction of a high-quality consensus community for TRON and BTT. It is estimated that BT Tycoon will contribute valid data for over one million user to TRON and BTT.      BTTycoon Presentation   Date : Every Monday, Wednesday, Friday & Saturday.   Time: 8 PM SG/MY   1 PM Nigeria   2 PM Madrid   3 PM Helsinki   5.30 PM India/Sri Lanka   Agenda   1. What is BTTycoon?   2. How to Download, Install, Register?   3. How to fund in and withdraw?   4. How to apply for a Job?   5. how much do we earn?   6. How to leverage on 8-4-2 system?   7. How to invite to Zoom?   8. Q & A      Please click the register button.         Online Event                                                               ","Link":"https://www.eventbrite.sg/e/free-webinar-wealth-creation-using-gaming-and-blockchain-technology-tickets-114306973234?aff=ebdssbonlinesearch"},{"Title":"FREE Webinar:  New Wealth Creation In Blockchain And Gaming Industry","Date":"Fr., 31. Juli 2020 14:00 CEST + 78 weitere Events","Price":"Kostenlos","Information":"                        BT Tycoon is an important project for TRON and BTT to get into community gaming. It will promote BTT circulation, increase market value and consolidate the construction of a high-quality consensus community for TRON and BTT. It is estimated that BT Tycoon will contribute valid data for over one million user to TRON and BTT.      BTTycoon Presentation   Date : Every Monday, Wednesday, Friday & Saturday.   Time: 8 PM SG/MY   1 PM Nigeria   2 PM Madrid   3 PM Helsinki   5.30 PM India/Sri Lanka   Agenda   1. What is BTTycoon?   2. How to Download, Install, Register?   3. How to fund in and withdraw?   4. How to apply for a Job?   5. how much do we earn?   6. How to leverage on 8-4-2 system?   7. How to invite to Zoom?   8. Q & A      Please click the register button.         Online Event                                                               ","Link":"https://www.eventbrite.sg/e/free-webinar-new-wealth-creation-in-blockchain-and-gaming-industry-tickets-114780944896?aff=ebdssbonlinesearch"},{"Title":"FREE Webinar:  New Investment Window In Blockchain Combines With Gaming","Date":"Fr., 31. Juli 2020 14:00 CEST + 81 weitere Events","Price":"Kostenlos","Information":"                        BT Tycoon is an important project for TRON and BTT to get into community gaming. It will promote BTT circulation, increase market value and consolidate the construction of a high-quality consensus community for TRON and BTT. It is estimated that BT Tycoon will contribute valid data for over one million user to TRON and BTT.      BTTycoon Presentation   Date : Every Monday, Wednesday, Friday & Saturday.   Time: 8 PM SG/MY   1 PM Nigeria   2 PM Madrid   3 PM Helsinki   5.30 PM India/Sri Lanka   Agenda   1. What is BTTycoon?   2. How to Download, Install, Register?   3. How to fund in and withdraw?   4. How to apply for a Job?   5. how much do we earn?   6. How to leverage on 8-4-2 system?   7. How to invite to Zoom?   8. Q & A      Please click the register button.         Online Event                                                               ","Link":"https://www.eventbrite.sg/e/free-webinar-new-investment-window-in-blockchain-combines-with-gaming-tickets-114723507098?aff=ebdssbonlinesearch"},{"Title":"FREE Webinar:  Blockchain Gaming Investing Seminar Insider Tips","Date":"Fr., 31. Juli 2020 14:00 CEST + 81 weitere Events","Price":"Kostenlos","Information":"                        BT Tycoon is an important project for TRON and BTT to get into community gaming. It will promote BTT circulation, increase market value and consolidate the construction of a high-quality consensus community for TRON and BTT. It is estimated that BT Tycoon will contribute valid data for over one million user to TRON and BTT.      BTTycoon Presentation   Date : Every Monday, Wednesday, Friday & Saturday.   Time: 8 PM SG/MY   1 PM Nigeria   2 PM Madrid   3 PM Helsinki   5.30 PM India/Sri Lanka   Agenda   1. What is BTTycoon?   2. How to Download, Install, Register?   3. How to fund in and withdraw?   4. How to apply for a Job?   5. how much do we earn?   6. How to leverage on 8-4-2 system?   7. How to invite to Zoom?   8. Q & A      Please click the register button.         Online Event                                                               ","Link":"https://www.eventbrite.sg/e/free-webinar-blockchain-gaming-investing-seminar-insider-tips-tickets-114795502438?aff=ebdssbonlinesearch"},{"Title":"FREE Webinar:  New Investing Opportunity - Blockchain Integrated In Gaming","Date":"Fr., 31. Juli 2020 14:00 CEST + 79 weitere Events","Price":"Kostenlos","Information":"                        BT Tycoon is an important project for TRON and BTT to get into community gaming. It will promote BTT circulation, increase market value and consolidate the construction of a high-quality consensus community for TRON and BTT. It is estimated that BT Tycoon will contribute valid data for over one million user to TRON and BTT.      BTTycoon Presentation   Date : Every Monday, Wednesday, Friday & Saturday.   Time: 8 PM SG/MY   1 PM Nigeria   2 PM Madrid   3 PM Helsinki   5.30 PM India/Sri Lanka   Agenda   1. What is BTTycoon?   2. How to Download, Install, Register?   3. How to fund in and withdraw?   4. How to apply for a Job?   5. how much do we earn?   6. How to leverage on 8-4-2 system?   7. How to invite to Zoom?   8. Q & A      Please click the register button.         Online Event                                                               ","Link":"https://www.eventbrite.sg/e/free-webinar-new-investing-opportunity-blockchain-integrated-in-gaming-tickets-114781346096?aff=ebdssbonlinesearch"},{"Title":"BSIC Annual Conference","Date":"Mi., 16. Sep. 2020 15:00 CEST","Information":"","Link":""},{"Title":"Future Tech Series Event #5 Cybersecurity & Blockchain","Date":"Do., 27. Aug. 2020 10:00 CEST","Information":"","Link":""},{"Title":"Luno Ghana AMA","Date":"Sa., 8. Aug. 2020 17:00 CEST","Price":"Kostenlos","Information":"                              Sat, August 8, 2020   5:00 PM – 6:00 PM CEST   Add to Calendar   Online Event   Organizer of Luno Ghana AMA   © 2020 Eventbrite   \n                    Your email will only be seen by the event organizer. View privacy policy.\n                   Outlook Calendar   Google Calendar   Apple Calendar   Yahoo Calendar   You will be notified by email one hour before the onsale. Reminders can be managed from the event listing.   Events are social. Allow Facebook friends to see your upcoming events?   Please help Eventbrite investigate this event by providing information about why you're reporting it.","Link":"https://www.eventbrite.com/e/luno-ghana-ama-tickets-114298467794?aff=ebdssbonlinesearch"},{"Title":"Ext-Episode 3: STEM - Equitable Opportunities","Date":"Do., 30. Juli 2020 18:00 CEST","Price":"Kostenlos","Information":"                           Let's have an open debate! Join our interactive session to increase the audience’s engagement and ensure that experts have a voice, collaborate and find solutions in a respected environment.      Host : Susan Falola, CEO / Creative Director JUUBIX   JUUBIX is a distributed connected cloud network for internal and external collaboration activities. By matching ideas to expertise and investment in a two sided marketplace that calculates the liquidity value of the overall network.      Samuel Dare Blockchain Technology Architect at Genysys   Experienced architect delivering end-to-end enterprise solutions across Blockchain and DevOps. Blockchain / Distributed Ledger: Hyperledger Fabric, Ethereum, Cloud: Azure, AWS, Google Cloud Platform.Container Orchestration: Kubernetes, Docker, Docker Swarm Infrastructure as Code: Ansible, Terraform.      Veronica Mihai Founder of Bloomwater Capital   Bloomwater Capital, is a hedge fund based in the BVI that employs quantitative algorithmic trading strategies for traditional and cryptocurrency markets offering the opportunity for professional investors to diversify their portfolio whilst adhering to traditional business principles of regulation, transparency and trust.      Martin Gassner Licensed Blockchain Expert   Recently qualified blockchain expert and business graduate, experienced in corporate finance and investment banking. Support Treasury Sales to recognize hedging opportunities, got to know different financial statements of companies and application knowledge of derivatives.      Kwasi Affum Founder of Future Banking & Slow Money Club   Future Banking is a platform where Fintech meets Diversity, supporting funding and awareness of BAME entrepreneurs by holding events that bring together diverse groups of experts to explore forward-thinking topics on the future banking ecosystem. SlowMoneyClub helps individuals go from employee to entrepreneur by turning ones dreams into income streams.      Join our interactive session at the end to get your questions answered by our experts.            Thu, 30 July 2020                                                ","Link":"https://www.eventbrite.co.uk/e/ext-episode-3-stem-equitable-opportunities-tickets-113205035308?aff=ebdssbonlinesearch"},{"Title":"Collective Intelligence Virtual Summit v1.3","Date":"Fr., 25. Sep. 2020 17:30 CEST","Price":"Kostenlos","Information":"                              Fri, Sep 25, 2020, 5:30 PM –   Sat, Sep 26, 2020, 2:30 AM CEST   Add to Calendar   Online Event   Organizer of Collective Intelligence Virtual Summit v1.3   © 2020 Eventbrite   \n                    Your email will only be seen by the event organizer. View privacy policy.\n                   Outlook Calendar   Google Calendar   Apple Calendar   Yahoo Calendar   You will be notified by email one hour before the onsale. Reminders can be managed from the event listing.   Events are social. Allow Facebook friends to see your upcoming events?   Please help Eventbrite investigate this event by providing information about why you're reporting it.","Link":"https://www.eventbrite.com/e/collective-intelligence-virtual-summit-v13-tickets-113730368594?aff=ebdssbonlinesearch"},{"Title":"FINTECH FINANCE CONFERENCE 2020 - Virtual, ONLINE","Date":"Do., 24. Sep. 2020 10:00 CEST","Price":"Ab 150,00 £","Information":"                        FinTech World Forum 2020 (http://fintechconferences.com) is based in London UK Europe as one of leading fintech events 2020 for global financial services, finance and banking technology industry. Its focuses on Mobile Payments, Lending, Insurance, Blockchain, Bitcoin, Investment, Money, Crypto, Cryptocurrency, Digital, Innovation, Wallet, Pensions, Funds, Payment, Tech, Financial Services, Technology, Bank, Wealth Management, Insurtech, Regtech and Wealthtech. For more info visit: http://fintechconferences.com         Thu, 24 Sep 2020, 10:00 –   Fri, 25 Sep 2020, 16:00 CEST   Add to Calendar   Online Event   No Refunds   Organiser of FINTECH FINANCE CONFERENCE 2020 - Virtual, ONLINE   © 2020 Eventbrite   \n                    Your email will only be seen by the event organiser. View privacy policy.\n                   Outlook Calendar   Google Calendar   Apple Calendar   Yahoo Calendar   You will be notified by email one hour before the onsale. Reminders can be managed from the event listing.   Events are social. Allow Facebook friends to see your upcoming events?   Please help Eventbrite investigate this event by providing information about why you're reporting it.","Link":"https://www.eventbrite.co.uk/e/fintech-finance-conference-2020-virtual-online-tickets-112211431412?aff=ebdssbonlinesearch"},{"Title":"BANSEA Angels Meet: Longhash Ventures","Date":"Di., 25. Aug. 2020 10:00 CEST","Price":"Kostenlos","Information":"                        About the presenter:   Wei Shi Khai is Chief Operating Officer at LongHash Ventures, where he is responsible for the operational excellence and management of the company’s blockchain incubation and investment outreach. Shi Khai spearheads the development and rollout of LongHash Hatch Program, having raised over $16 million in funding to date. Shi Khai was previously a management consultant at McKinsey, with a focus on digital transformation and analytics across the financial and telecommunications sector across Southeast Asia. Shi Khai holds a Bachelor of Science from Imperial College London.   About LongHash Ventures:   LongHash Ventures is a global blockchain accelerator and investor building the native Web 3.0 blockchain economy. With a global network established across key technological hubs including Singapore, Shanghai, and Hong Kong, the company is committed to catalyzing growth for the next generation of blockchain startups. In parallel, LongHash Ventures offers end-to-end support across the spectrum of strategy formulation, go-to-market execution, and subject matter guidance across technology, marketing, and fundraising. LongHash Ventures is supported by Fenbushi Capital, Hashkey Capital under Wanxiang Group, and Enterprise Singapore, a statutory board under the Ministry of Trade and Industry.         Tue, 25 August 2020   10:00 – 11:00 CEST   Add to Calendar   Online Event   Organiser of BANSEA Angels Meet: Longhash Ventures   Established in 2001, the Business Angel Network of Southeast Asia (BANSEA) is a leading angel investment network promoting the development of the angel investment community in Southeast Asia through educational conferences, workshops, research, networking with angel groups worldwide, contributing to improving the environment and corporate governance system for angel investing, and facilitating the matching of early stage companies with angel investors.   © 2020 Eventbrite   \n                    Your email will only be seen by the event organiser. View privacy policy.\n                   Outlook Calendar   Google Calendar   Apple Calendar   Yahoo Calendar   You will be notified by email one hour before the onsale. Reminders can be managed from the event listing.   Events are social. Allow Facebook friends to see your upcoming events?   Please help Eventbrite investigate this event by providing information about why you're reporting it.","Link":"https://www.eventbrite.sg/e/bansea-angels-meet-longhash-ventures-tickets-114635463758?aff=ebdssbonlinesearch"},{"Title":"Infiom Salon Virtual","Date":"Mi., 5. Aug. 2020 21:30 CEST + 10 weitere Events","Price":"Kostenlos","Information":"                        Infiom Salon Agenda   Because of widespread fear and uncertainty, the coming months will challenge even the strongest and most nimble businesses attempting to return to some semblance of normal. It's going to take untold ingenuity and innovation to usher Economy 2.0. The way we did business before the pandemic is probably going to change. We will examine ways to accelerate venture growth in this new environment.   Welcome Address -- Mariana Danilovic, Founder and CEO, Infiom, LLC   Keynote Presentation   1. NAGRA’s GO Live! Platform -- Vic Knotter-Finney, VP Market Development, NAGRA – Kudelski Group   2. The State of Blockchain -- Christian Kameir, Managing Partner, Sustany Capital   3. Melanie Mohr, CEO, WOM Protocol   4. John Paukulis   Panel Discussion   1:10-1:30 pm -- INTERACTIVE SEGMENT -- Meet Our Presenters and Team Members -- Discussion Groups in Separate Rooms   Bring your questions and your 60 second pitch about your Company for the round-table discussion. Our Speakers and producers want to meet you!   Join us for our online webinar and networking to help build relationships and a stronger and more connected blockchain, AI, AR/VR and disruptive technology ecosystem.   Sponsors & Presenters   Vic Knotter-Finney, VP Market Development, NAGRA – Kudelski Group   Vic has been in the PayTV, Digital Media Industry for approaching 30 years. Creating new things with global teams that touch people’s lives is intensely satisfying to him. He started his career in the early 90s working for Oracle’s Video Server team deploying some of the world’s first Video on Demand solutions to the likes of British Telecom in the UK and Telia in Sweden.   He has had the pleasure of working with many talented individuals through the years at world class organizations. He’s brought; clarity of vision, entrepreneurship balanced with common sense.   Disruption, .. thinking differently and finding the win-win is something he is passionate about.   Currently Vic works for NAGRA, a global leader for convergent media solutions for the delivery of digital and interactive content. Here, Vic has a leading role in product / service innovation and the creation of go-to-market initiatives that leverage new technologies and partner ecosystems. Thou his focus has been within the PayTV / Digital Media Industry, while working in Corporate Development and Technology DNA divergence he’s had the opportunity and enjoyed the challenge of bringing a fresh set of eyes and perspective across a diverse range of industries including: Sports / Event Stadium and People Access, Utility / Energy Management, Smart Home - Lifestyle Devices Internet of Things (IoT), Health Industry.   Today, Vic will introduce the audience to NAGRA’s GO Live proposition: A complete solution for streaming TV to iOS, Android and TV based devices.   Christian Kameir, Managing Partner, Sustany Capital   Christian Kameir is a managing partner at blockchain venture fund Sustany Capital in Newport Beach. Mr. Kameir has been a technology entrepreneur since the dial-up days and led the merger of two of the earliest internet service providers in Europe, after which he immigrated from Germany to California to establish a international investment firm. After founding a Yelp-predecessor in 2004, and selling the operation in 2008, he joined the board of several high-tech companies. In addition to majoring in business, he studied classical literature, is certified in NLP and a graduate of Muenster's School of Law. He is known for publishing one of the first law blogs in Europe and drafting laws for the open telecommunication market, specifically innovative services. Mr. Kameir is a member of Forbes Finance Council and seasoned public speaker on topics ranging from high-tech investing to blockchain solutions.   Melanie Mohr, CEO, WOM Protocol   Melanie Mohr is a Berlin-based entrepreneur with 20 years’ experience media, marketing and technology. In 2016 she founded YEAY - the leading community for Generation Z to share honest recommendation videos with one another about the lifestyle products they love. In 2018 she became the founder and CEO of the WOM Protocol, the blockchain company helping brands tap into peer-to-peer recommendations and digital publishers monetize their platforms in a user-friendly way through word-of-mouth content.Melanie is a four-time founder and a strong female presence in the tech and blockchain scenes. She is a member and Global Chair of the prestigious H2 network from Silicon Valley as well as a chapter lead of the Disruption Disciples.                                             ","Link":"https://www.eventbrite.com/e/infiom-salon-virtual-tickets-111736133784?aff=ebdssbonlinesearch"},{"Title":"The Crypto Curious Course","Date":"Sa., 1. Aug. 2020 19:00 CEST + 8 weitere Events","Price":"Kostenlos","Information":"                              Learn about what Bitcoin is, where it came from, and how blockchain and cryptocurrency are connected. The course covers the specifics about how cryptocurrencies work and helps paint a larger picture of the context in which Bitcoin was created.            Online Event   Organizer of The Crypto Curious Course   The Blockchain Institute is a Public Charity that provides blockchain education for everyone that wants to learn. We promote the adoption, development, and use of blockchain technology.   © 2020 Eventbrite   \n                    Your email will only be seen by the event organizer. View privacy policy.\n                   Outlook Calendar   Google Calendar   Apple Calendar   Yahoo Calendar   You will be notified by email one hour before the onsale. Reminders can be managed from the event listing.   Events are social. Allow Facebook friends to see your upcoming events?   Please help Eventbrite investigate this event by providing information about why you're reporting it.","Link":"https://www.eventbrite.com/e/the-crypto-curious-course-tickets-114706105048?aff=ebdssbonlinesearch"},{"Title":"Legal 101 For Tech Companies And Startups: What Entrepreneurs Should Know","Date":"Do., 6. Aug. 2020 11:00 CEST","Price":"Kostenlos","Information":"                        Izwan will be sharing his thoughts on the topic and what startups need to know.   *Izwan will be taking questions from those attending the live Facebook session or you may email it to hello@asiablockchainreview.com         Who should attend this event?      This event is suitable for people looking at understanding the legal perspective of starting a tech company and what entrepreneurs or founders should look out for..         Guest Speakers :   Izwan Zakaria   Managing Partner      About Izwan   Izwan Zakaria is the managing partner of Izwan & Partners, a corporate and technology law firm focusing on advising tech companies, startups, and investors in Malaysia and overseas.   Izwan has extensive legal experience in acting for technology companies such as equity crowdfunding, peer to peer, ecommerce, and robo advisory platforms in their compliance matters especially when dealing with the regulators like the Central Bank of Malaysia and the Securities Commission. Izwan also has a wide range of fundraising experience in advising startups, social enterprises, non-profits, and venture capital and private equity funds on matters ranging from compliance, governance to investment documents.   Izwan is a member of the Fintech Association of Malaysia and active in the Malaysian startup ecosystem, where he regularly mentors early stage entrepreneurs on compliance and fundraising matters. Izwan is also a legal partner and mentor at Founder Institute (a pre-seed start-up accelerator with a presence in over 180 cities worldwide). Recently, Izwan has also been listed as one of the 'Top 30 People to Watch in the Business of Law ' by the Asia Law Portal.         Then this is the event for you to join. Register now to receive landscape reports and content from Asia Blockchain Review.   If you have any questions for Izwan, please email it over to hello@asiablockchainreview.com      About Asia Blockchain Review                                                      ","Link":"https://www.eventbrite.com/e/legal-101-for-tech-companies-and-startups-what-entrepreneurs-should-know-tickets-114838773864?aff=ebdssbonlinesearch"},{"Title":"Futurist Conference 2020: FREE Blockchain & Innovation Virtual Event","Date":"Mi., 11. Nov. 2020 18:00 CET","Information":"","Link":""},{"Title":"Donate Crypto, Lower Your Taxes","Date":"Do., 20. Aug. 2020 18:00 CEST","Price":"Kostenlos","Information":"                        Join us for a quick discussion on why people are increasingly donating cryptocurrency as a way to save on taxes. Would you rather donate to the IRS or you favorite charity?   Topics Will Include:   Speaker Bios:   The Giving Block:   The Giving Block has created the only nonprofit specific solution for accepting Bitcoin and other cryptocurrency donations. The Giving Block solution accepts multiple cryptocurrencies, giving donors of many cryptocurrencies the same tax incentive (Bitcoin, Ethereum, Litecoin, Bitcoin Cash, Zcash and more). The Giving Block's solution also allows for automatic crypto to cash conversions and generates tax receipts for donors.   NODE40:   NODE40 is a financial services provider for individuals and businesses that have interacted with cryptocurrency. NODE40's flagship product Balance, is a robust cryptocurrency tax calculation software that integrates directly with major cryptocurrency exchanges and custodial wallets. Members of the blockchain community transacting in, trading, or mining digital currency, have triggered taxable events and may be unaware of how to properly disclose these transactions to the government.   Cred:   Cred is a decentralized global lending and borrowing platform that allows users to receive up to 10% APR on their cryptocurrencies. Founded by former PayPal financial technology veterans, Cred’s mission is to harness the power of blockchain to allow everyone to benefit from low-cost credit products. Cred brings together a diverse team of entrepreneurial leaders, machine learning, and blockchain technology.                  Thu, August 20, 2020   6:00 PM – 7:00 PM CEST   Add to Calendar   Online Event   Organizer of Donate Crypto, Lower Your Taxes   © 2020 Eventbrite   \n                    Your email will only be seen by the event organizer. View privacy policy.\n                   Outlook Calendar   Google Calendar               ","Link":"https://www.eventbrite.com/e/donate-crypto-lower-your-taxes-tickets-115394685611?aff=ebdssbonlinesearch"},{"Title":"Legal Impacts of Distributed Autonomous Organizations (DAOs) Online","Date":"Mi., 26. Aug. 2020 19:00 CEST","Price":"Kostenlos","Information":"                           One of the first DAOs was launched in 2016 as a venture capital organization. It raised about $150 million in crowdfunding before it was hacked and failed. However, since then many new DAOs have merged including decentralized exchanges, and many new types of DAOs are being built today. Communities around the world building DAOs have lots of questions. They include:      How do government regulations regarding corporate formation apply to an organization on a global blockchain developed by members around the world?   What legal jurisdiction applies to it?   Who has liability for the organization and it’s actions if the actions are made by a consensus of the members?   How are issues of liability addressed when someone may feel wronged?   What are the intellectual-property considerations? Can a DAO own property?   If a DAO makes a profit, how is it taxed? what jurisdiction applies to it?   How would a DAO deal with technology transfer regulations?   What reporting requirements would it have and to whom?   Come and join an online discussion about these topics with members of the GBA Working Group. We will have a panel of three speakers followed by a question and answer session and open dialog with event participants. Our speakers include:      Miles Vaughn – Miles is a privacy and regulatory compliance attorney with expertise in the financial services industry. An expert in money transmission licensing, he provides advice for virtual currency companies attempting to navigate the evolving regulatory landscape. He has a strong technical understanding of blockchain and distributed ledger technologies and has recently been published on the use of DLT in financial record-keeping systems and the impact of GDPR on blockchain enterprises. Miles has work experience in both the public and private sectors, including the Federal Communications Commission, Department of Commerce, and Facebook. He is a Certified Information Privacy Professional for both the United States and Europe (CIPP/US, CIPP/E) and has extensive experience with both domestic and international privacy regulations. Miles is a graduate of the American University Washington College of Law and has a degree in Chinese Language Studies and International Relations from the University of Rochester. Miles is licensed to practice law in the District of Columbia.   Mike Bombace – Mr. Bombace advises several clients on Blockchain, Distributed Ledger Technology, and other emerging technologies related to the payments, legal and regulatory needs, and compliance. He is an alumnus of Ripple, Citi, Booz Allen, and others.   1 Open Panel Vacancies – Volunteer to speak at this event      This event is free, but you must register below   https://www.gbaglobal.org/event/legal-impacts-of-daos/         Wed, August 26, 2020   7:00 PM – 9:00 PM CEST                                             ","Link":"https://www.eventbrite.com/e/legal-impacts-of-distributed-autonomous-organizations-daos-online-tickets-114625668460?aff=ebdssbonlinesearch"},{"Title":"IOTA Course for Developers // Learning App with Premium Support","Date":"Do., 30. Juli 2020 09:00 CEST + 62 weitere Events","Price":"Ab 499,50 €","Information":"                           - Access to the Learning-App (App for mobile devices + Webapp for Notebook or PC)      - Extensive and complete In-App Course (6 weeks duration, though you can set your own pace)      - Premium Support via In-App Messenger (from real IOTA Coders)         This course let you explore all the IT libraries and resources as well as developer tools that you need to start sending and receiving transactions.      This course also gives you all knowledge that you need to set-up a professional development environment and automated tests, debugging, deployment, etc.      You will learn how to code with the MAM library and send and receive data streams.      You will also learn the main concepts and features of Qubic.      You are asked to develop your own fully functional IOTA Application. If you don’t have a clue what to do we will help you to find a project vision.      Requirements      You would need to have an engineering or computer science background or be at least a highly motivated autodidact   Basic understanding of Blockchain & PGP or Cryptography   Developer Skills: you'd need to have good JavaScript skills (JS)                                                                                                                                 ","Link":"https://www.eventbrite.de/e/iota-course-for-developers-learning-app-with-premium-support-tickets-87301949481?aff=ebdssbonlinesearch"},{"Title":"Blockchain 1 Day Mini Bootcamp 6 hours [$325] - online event","Date":"Sa., 1. Aug. 2020 07:30 CEST + 98 weitere Events","Price":"Ab 325,00 $","Information":"                        Eventbrite's fee is nonrefundable.      Request you to please fill this mandatory registration form-      Know Your ClientS (Quick Survey).....!!   https://forms.gle/TWex1xQ7VnRBtrk39         Course Fee - $325 (Total)      Contact Details   shivgan3@gmail.com   Shivgan Joshi - 929 356 5046   Dr. Vora - +1 (312) 285-6886      Our data analytics classes are taught by top instructors using our proprietary curriculum.            Instructors:   (Instructor has taken several sessions in NYC and will explain you all concepts in a very eloquent manner.)   Our training theme is centered around projects, for example, your portfolio or even themes you are doing at work. This is very different from the repetitive courses given by other tutors with a fixed syllabus. The outcome of such engagement is a product you can use.                                                                                                                                                                  ","Link":"https://www.eventbrite.com/e/blockchain-1-day-mini-bootcamp-6-hours-325-online-event-tickets-101428068082?aff=ebdssbonlinesearch"},{"Title":"CoinAgenda Presents: \"Europe Crypto Update\"","Date":"Mi., 23. Sep. 2020 19:00 CEST","Information":"","Link":""},{"Title":"FREE Webinar:  Creating Wealth Using Blockchain Gaming Investing Tips","Date":"Fr., 31. Juli 2020 14:00 CEST + 79 weitere Events","Price":"Kostenlos","Information":"                        BT Tycoon is an important project for TRON and BTT to get into community gaming. It will promote BTT circulation, increase market value and consolidate the construction of a high-quality consensus community for TRON and BTT. It is estimated that BT Tycoon will contribute valid data for over one million user to TRON and BTT.      BTTycoon Presentation   Date : Every Monday, Wednesday, Friday & Saturday.   Time: 8 PM SG/MY   1 PM Nigeria   2 PM Madrid   3 PM Helsinki   5.30 PM India/Sri Lanka   Agenda   1. What is BTTycoon?   2. How to Download, Install, Register?   3. How to fund in and withdraw?   4. How to apply for a Job?   5. how much do we earn?   6. How to leverage on 8-4-2 system?   7. How to invite to Zoom?   8. Q & A      Please click the register button.         Online Event                                                               ","Link":"https://www.eventbrite.sg/e/free-webinar-creating-wealth-using-blockchain-gaming-investing-tips-tickets-114795883578?aff=ebdssbonlinesearch"},{"Title":"Iconic Lab Reunion","Date":"Do., 6. Aug. 2020 18:00 CEST","Price":"Kostenlos","Information":"                        Iconic Holding brings blockchain entrepreneurs, industry experts, and innovators together to discuss the latest market developments and trends, share their expertise about the latest important topics, and explore synergies together!   Special Edition: Iconic Lab Reunion      SPEAKER PROFILES      - Max Lautenschläger, Co-founder & COO, Iconic Holding   - Kaze A. ONGUENE, CEO, BRAINCITIES ®   - Christopher Georgen, Founder & Chief Architect, Topl   - Andreas Schemm, CEO, Vreo   - Tristan Littlejohn, CEO, Based Global      MODERATOR   • Patrick Lowry, CEO and Co-Founder, Iconic Holding      AGENDA:   CET 18:00-18:40 Introduction and Fireside chat   CET 18:40- 19:00 Q&A      ET 12:00-12:40 Introduction and Fireside chat   ET 12:40-13:00 Q&A      Register today and you will receive a confirmation email containing information about joining the webinar!                                                                     ","Link":"https://www.eventbrite.com/e/iconic-lab-reunion-tickets-115027472266?aff=ebdssbonlinesearch"},{"Title":"BLOCKCHAIN SUMMIT GLOBAL 2020","Date":"Do., 3. Sep. 2020 13:30 CEST","Price":"Kostenlos","Information":"                        Podrás registrarte FREE aquí y acceder a todo el evento virtual 3 y 4 de septiembre totalmente gratis.   También podrás comprar en nuestra WEB próximamente:   - LINK_VIP a solo USD 20 para acceder a contenido exclusivo + Networking asistido + “Entrevistas Virtuales Uno a Uno”   - Pase Presencial (Viernes 4 de Septiembre) a USD 70 (complimentary Food & Beverage) a nuestro COCKPIT de OPERACIONES, con un asiento especial en un verdadero Estudio de TV.   https://www.blockchainsummit.global/   Agendate ya! - Jueves 03 y Viernes 04 de SEPTIEMBRE/2020            jue., 3 de sep. de 2020, 13:30 –   sáb., 5 de sep. de 2020, 0:00 CEST   Añadir al calendario   Evento online   Organizador de BLOCKCHAIN SUMMIT GLOBAL 2020   © 2020 Eventbrite   \n                    Solo el organizador del evento podrá ver tu correo electrónico. Ver política de privacidad.\n                   Calendario de Outlook   Calendario de Google   Calendario Apple   Calendario Yahoo!   Se te notificará por correo electrónico una hora antes de la venta. Los recordatorios se pueden gestionar desde la lista de eventos.   Los eventos son sociales. ¿Querés que tus amigos de Facebook puedan ver tus próximos eventos?   Podés ayudar a Eventbrite a investigar este evento explicando por qué nos informaste al respecto.","Link":"https://www.eventbrite.com.ar/e/blockchain-summit-global-2020-registration-112522206950?aff=ebdssbonlinesearch"},{"Title":"BitAngels Columbus Virtual Event (July 2020)","Date":"Do., 13. Aug. 2020 19:00 CEST","Price":"Kostenlos","Information":"                        After registering, the meeting room link will be sent to your email the morning of the event.   **This event will be recorded but video access is limited to BitAngels investor members, who may join for the live event as well as view the recording afterward. To learn more about becoming a member, visit https://www.bitangels.network/membership.   BitAngels is a group of cryptocurrency investors helping to grow the blockchain ecosystem through community events and company spotlights since 2013 . For more information, please visit our website. Past BitAngels funded companies include Maidsafe, Factom, Ethereum, BnkToTheFuture, Shapeshift, and Storj.            Thu, August 13, 2020   7:00 PM – 8:30 PM CEST   Add to Calendar   Online Event   Organizer of BitAngels Columbus Virtual Event (July 2020)   BitAngels is a blockchain and cryptocurrency investor network. Join us for an upcoming BitAngels networking event in your city.\n\nThe brainchild of industry leaders Michael Terpin and David Johnston in 2013, BitAngels has grown from being the world’s first angel network for digital currency startups to the largest.\n\nBitAngels aims to accelerate blockchain adoption globally by connecting entrepreneurs, investors, and the community through exclusive networking events. Founders are invited to pitch their projects to investors, and investors get an inside look at some of the most exciting up-and-coming blockchain ventures.\n\nPast BitAngels funded companies include Maidsafe, Factom, Ethereum, BnkToTheFuture, Shapeshift, and Storj.           © 2020 Eventbrite   \n                    Your email will only be seen by the event organizer. View privacy policy.\n                   Outlook Calendar   Google Calendar   Apple Calendar   Yahoo Calendar   You will be notified by email one hour before the onsale. Reminders can be managed from the event listing.   Events are social. Allow Facebook friends to see your upcoming events?   Please help Eventbrite investigate this event by providing information about why you're reporting it.","Link":"https://www.eventbrite.com/e/bitangels-columbus-virtual-event-july-2020-tickets-111204252914?aff=ebdssbonlinesearch"},{"Title":"Secure Infrastructure for Digital Assets (Online Panel)","Date":"Di., 25. Aug. 2020 15:00 CEST","Price":"Kostenlos","Information":"                        Secure Infrastructure for Digital Assets (Online Panel)      DATE & TIME   Date: Tuesday, August 25, 2020   Time: 15h00-16h00   Mode: online talk via Zoom; Zoom dial-in URL will be sent previous to the online talk      SPEAKERS      ABOUT DISRUPT NETWORK   Blockchain and community building. This is our mission. The Coronavirus did not make things easier for us, but we will now move our events online to help education and dissemination in the blockchain area.      You want to become our speaker? We aim at 500+ video conference participants per talk. Write to: team@disrupt-network.io      HOW TO STAY UPDATED   We do online talks and online panel discussions 2x per week. We frequently post our next events on Twitter and on LinkedIn. Follow us to stay up to date:      LANGUAGE   This talk will be held in English.      CONTACT   Mail: team@disrupt-network.io   LinkedIn: https://www.linkedin.com/company/disrupt-network/                                                         ","Link":"https://www.eventbrite.de/e/secure-infrastructure-for-digital-assets-online-panel-tickets-114501338586?aff=ebdssbonlinesearch"},{"Title":"Fireside Chat: DAOs and Decentralized Governance","Date":"Do., 30. Juli 2020 19:00 CEST","Price":"Kostenlos","Information":"                        While DAOs have marked a place in blockchain history, they are often misunderstood. Firstly, the term \"DAO\" means different things to different people and secondly, many open-ended questions typically come up in conversations about DAOs:   In a short period of time, the virtual asset marketplace has already gone through several waves of innovation—from initial coin offerings, to security token offerings and decentralized finance.    Many experts and industry leaders have touted DAOs as the next major application of blockchain technology that will support virtual assets in the years to come.        Join us for our latest live fireside chat “DAOs and Decentralized Governance: How Autonomous Organizations are Transforming Virtual Assets” along with industry experts and thought leaders to discuss:    We invite you to join us for this Fireside Chat on July 30th featuring an exciting lineup of panelists to learn more about DAOs and the role of decentralized governance.       \n\t      Thu, July 30, 2020   7:00 PM – 8:30 PM CEST   \n\t\t\t\t\t\t\t\t\t\t\t\tAdd to Calendar\n\t\t\t\t\t\t\t\t\t\t\t   Online Event   Organizer of Fireside Chat: DAOs and Decentralized Governance   iComply Investor Services Inc. (iComply) is a Regtech company that provides fully-digital KYC and AML compliance solutions for non-face-to-face financial and legal interactions. iComply enables financial services providers to reduce costs, risk, and complexity and improve staff capacity, effectiveness, and customer experience. By partnering with multinational technology vendors such as Microsoft, DocuSign, Thomson Reuters, and Refinitiv, iComply is bringing compliance teams into the digital age. Learn more: www.icomplyis.com     Event creator   Events you might like:   © 2020 Eventbrite   \n                    Your email will only be seen by the event organizer. View privacy policy.\n                   Outlook Calendar   Google Calendar   Apple Calendar   Yahoo Calendar         ","Link":"https://www.eventbrite.ca/e/fireside-chat-daos-and-decentralized-governance-tickets-112698989712?aff=ebdssbonlinesearch"},{"Title":"Virtual Demo Day ( LongHash Hatch Batch 4)","Date":"Fr., 14. Aug. 2020 10:00 CEST","Price":"Kostenlos","Information":"                        Credmark: The world's first digital asset credit bureau equipping financial institutions with non-traditional credit data.   https://credmark.com/      Hashstacs: Helping financial institutions drastically reduce the cost and reconciliation time of capital market trades with their proprietary blockchain   https://stacs.io/      Pravica: A comprehensive communications suite focusing on security and privacy, with a seamless experience across email, chat, voice and video.   https://pravica.io/      StaTwig: An end-to-end tacking platform for the global vaccine supply chain with blockchain and IoT.      Viewbase: A one-stop curated market intelligence and analytics platform that brings transparency to digital asset investors and traders.   https://www.viewbase.com/      Xend: An African end-to-end merchant payment and e-commerce platform, enabling transactions even without an internet connection.   http://xend.africa/   Please register here: https://www.crowdcast.io/e/demoday            Fri, August 14, 2020   10:00 AM – 11:30 AM CEST   Add to Calendar                                             ","Link":"https://www.eventbrite.com/e/virtual-demo-day-longhash-hatch-batch-4-tickets-112741637272?aff=ebdssbonlinesearch"},{"Title":"The DLT & Corda Summit NYC","Date":"Do., 6. Aug. 2020 15:00 CEST","Price":"Kostenlos","Information":"                        Call for Speakers for DLT & Corda Summit NYC 2020:   https://sessionize.com/dltsummit2020/   The DLT & Corda Summit is a 2-day event focused on Distributed Ledger Technologies like Corda, HyperLedger and Quorum. Both days will have business and technical tracks, including the latest information, knowledge and use cases. Seats are extremely limited.   Speakers and programming will be announced shortly.         Thu, August 6, 2020   3:00 PM – 11:00 PM CEST   Add to Calendar   Online Event   Organizer of The DLT & Corda Summit NYC   Chainhaus is the first step for the next wave of professionals, investors, and adopters transitioning into blockchain, AI and Data Science.   We build trust by establishing credibility through education, training and community building.   © 2020 Eventbrite   \n                    Your email will only be seen by the event organizer. View privacy policy.\n                   Outlook Calendar   Google Calendar   Apple Calendar   Yahoo Calendar   You will be notified by email one hour before the onsale. Reminders can be managed from the event listing.   Events are social. Allow Facebook friends to see your upcoming events?   Please help Eventbrite investigate this event by providing information about why you're reporting it.","Link":"https://www.eventbrite.com/e/the-dlt-corda-summit-nyc-tickets-80480845375?aff=ebdssbonlinesearch"},{"Title":"PG Connects Helsinki Digital 2020 [ft. Blockchain Gamer LIVE! Digital]","Date":"Mo., 14. Sep. 2020 10:00 CEST","Price":"Ab 60,00 £","Information":"                        Monday, Sept 14 - Friday, Sept 18, 2020   Following two fantastic digital events in 2020, Pocket Gamer Connects will celebrate this year's Helsinki edition online too!   The need to connect and do business remains as strong as ever, despite many of us being isolated at home. We had hoped that IRL games industry networking events would return to normal as the year continues, but we've accepted that 2020 is going to be an unusual one all the way to the winter.   So let's keep the momentum going by squishing our traditional Helsinki edition together with our world-beating Digital editions to create an online event that you can join no matter where you're working from!   And while we're about it, do join our partner event about blockchain gaming. Your ticket enables access to both events, PG Connects Helsinki Digital and Blockchain Gamer LIVE! Digital - one mega week of conference activity.   Our pledge: we will continue to work incredibly hard to distil as much of the content and spirit as we can from the traditional PG Connects events you have come to know and love over the last seven years, and hone the format so it can be as genuinely useful as possible. That means expert talks, panels and round-tables, an improved digital meeting system, digital versions of Big Indie Pitches and fringe events like Publisher SpeedMatch, a pitching event for blockchain developers, and more surprises too.   As one of an expected 1,500+ delegates, you will have access to an innovative online platform for five days in September.   You'll be able to select from a programme of great live video content full of insight and practical advice across ten themed conference tracks. We will be celebrating the best of fantastic Finland, the spiritual home of mobile gaming, but also casting the net wide to bring you the most insightful content from around the world. You can watch the tracks live or catch up on the recorded videos within your own time, and if you're online while the speakers are performing you'll be able to interact with them and the other viewers with questions and comments.   We'll unveil the speakers and schedule progressively on the official sites (www.pgconnects.com/helsinki and www.blockchaingamer.live) and through our media channels, PocketGamer.biz and BlockchainGamer.biz.   You can expect the usual inspiring talks from over 250 speakers who will educate and inspire through an agenda of themed tracks set to cover monetisation and growth, global game trends and company culture, development tools and stories and strategies to thrive in the modern gaming market be it mobile, PC, console, blockchain or XR.   On top of the talks, you'll also be able to search and connect with other attendees, to meet, discuss, do deals and make plans using the MeetToMatch online meeting platform. The platform will go live a couple of weeks ahead of the event.   Plus we'll also be running online variants of our celebrated Big Indie Pitch, Investor Connector, and Publisher SpeedMatch activities, that will bring together specific groups with specific needs. Please register your interest at the links below and we will send you details...   INVESTOR CONNECTOR (developers, publishers and investors)   PUBLISHER SPEEDMATCH (developers and publishers)   BIG INDIE PITCH (all platforms welcome)   The event is called Connects because that’s what we help you do; connect with the whole gaming industry, from students and indie studios to the media, international investors and publishers. No other event puts you in touch with the entire mobile gaming industry like our Connects conferences, and this remains true of PG Connects Helsinki Digital and Blockchain Gamer LIVE! Digital.   We're not going to pretend that this online event will have all the benefits of a regular conference. There are no free drinks for a start (although you could crack open a bottle at home), no booths to wander or cool freebies to pocket, you obviously don't get the thrill of visiting a great Finnish city (unless you already live there, in which case: sorry we won't get to quaff lonkero with you this year) and generally there’ll be less of those incidental catch-ups and spontaneous meetings that often make the whole thing worthwhile.   We're also not going to pretend we'll get everything faultlessly perfect, there's a lot of tech platforms involved and we're evolving our approach all the time. But we know that you understand all that, you're in the games business, right? Everything is a work in progress, even after it's released! We also feel sure that you'll lend us your patience, trust and support to try and pull off something that can genuinely help us all stay connected, doing business and having fun through these challenging times.   More than 27,000 industry professionals have attended the Connects international conference series since 2014. Since then, the roadshow has landed in the UK, Canada, USA, Finland, Hong Kong, Jordan and India with a genuinely international client base; on average, delegates from more than 45 countries attend each event. With the advent of the Digital conference, we have seen this number grow! There were 68 countries represented at our June online event, and in 2020 we know that over 70% of our audience works in game creation/publishing.   In 2016, PG Connects became the biggest dedicated mobile games industry conference series in Europe and has stayed on top ever since. Every event has been bigger and better than the last, and since 2017 we’ve added VR/AR, PC, console and blockchain to the mix. Our Digital events in April and June smashed expectations with over 1,400 attendees.   Previous speakers and delegates from all the key industry players include Supercell, King, Space Ape Games, Niantic, SYBO, Tencent, Mythical Games, Unity, Jam City, Skybound, Apple, Rovio, Disney, Super Evil Megacorp, Wargaming, Kabam, NetEase, NTT Docomo, Ubisoft, Facebook, Google, Square Enix, Microsoft, Electronic Arts, Gameloft, Sega, Capcom, Twitter, Snapchat, Twitch, NaturalMotion, N3TWORK and many, many, many more. If you'd like to speak at PGC Digital, or another of our upcoming events, please sign up using our Speaker Submission form.   And because Steel Media owns and operates the leading media in this space too, including PocketGamer.com, PocketGamer.biz and PCGamesInsider.biz, our events benefit from unrivalled press coverage. A combined website readership of well over a million users a month, 300,000 engaged Twitter followers, nearly 120,000 subscribers on YouTube, all await. Our events include opportunities - like a Journalist Bar (operating in Discord for our Digital events) - where you can show writers and editors your games.   Select your ticket above and follow the simple online booking system. Payment is required at the time of booking, so please have your credit or debit card ready.                                                                           ","Link":"https://www.eventbrite.co.uk/e/pg-connects-helsinki-digital-2020-ft-blockchain-gamer-live-digital-tickets-107688148150?aff=ebdssbonlinesearch"}]